{"_type": "playlist", "entries": [{"_type": "url", "ie_key": "Youtube", "id": "2tKQUXy0ig0", "url": "2tKQUXy0ig0", "title": "Serve & Volley — What Do You Notice?", "description": "In this clip, I’m simply demonstrating a few serve-and-volley sequences, including slow-motion replays. Watch the serve, the split step, the positioning, and how the volleys are played —...", "duration": 180.0, "view_count": null, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "-1VnQj6SmSw", "url": "-1VnQj6SmSw", "title": "Topspin in Tennis Works — If You Can Hit the Sweet Spot", "description": "In this video, I explain why heavy topspin in tennis is much harder to execute than most advice suggests. The racket travels steeply and fast, while the ball moves more horizontally, leaving...", "duration": 482.0, "view_count": 4566, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "PZLiR8Mcl8o", "url": "PZLiR8Mcl8o", "title": "How to Build an Effortless Forehand Through Feel", "description": "This lesson shows why understanding the forehand is often not enough — and how helping the body feel stability, rotation, and wrist acceleration leads to effortless speed and cleaner contact....", "duration": 1017.0, "view_count": null, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "hgq_09zrqEA", "url": "hgq_09zrqEA", "title": "Legs Warm Up Drill For Neutral And Open Stance", "description": "This simple but effective drill wakes up your legs at the start of your session and tests your leg-stroke coordination and balance. Perform once or twice from the left singles sideline to the...", "duration": 174.0, "view_count": null, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "RWWplT5yiRs", "url": "RWWplT5yiRs", "title": "The Inside-Out Swing That Makes Forehands Feel Easy", "description": "This lesson shows why many forehands feel rushed and stressful — and how changing the swing path creates more time, stretch, and cleaner contact. By learning to swing around the ball earlier,...", "duration": 548.0, "view_count": null, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "bZFw2UpybNc", "url": "bZFw2UpybNc", "title": "Why There Is No Free Power in Tennis", "description": "Most tennis tips promise more power — but rarely explain the cost. In this video, I explain why increasing shot speed always reduces your margin for error. As the ball travels faster, the...", "duration": 650.0, "view_count": 7778, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "i6WZnAtr3bo", "url": "i6WZnAtr3bo", "title": "My Simple Warm Up Dynamic Stretch Before A Tennis Session", "description": "This is the quick, simple dynamic stretch I personally use as my absolute baseline warm-up before every tennis session. Consider this the non-negotiable minimum routine you must do, especially...", "duration": 116.0, "view_count": null, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "FRfXJ9UolL0", "url": "FRfXJ9UolL0", "title": "How to Feel the Forearm Stretch in Your Forehand", "description": "This lesson explores where power actually comes from in the forehand.\nNot from a bigger swing, not from pushing with the body — but from a short, hidden hit inside a relaxed, longer stroke....", "duration": 736.0, "view_count": null, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "yz3yTggAdaU", "url": "yz3yTggAdaU", "title": "Volley Warm Up - But From The Baseline Player's Perspective", "description": "You're seeing the action from behind Urban, who is feeding me volleys from the baseline. This clip showcases the specific, cooperative patterns we use to build consistency, not just speed....", "duration": 74.0, "view_count": null, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "F8wY_0q5yns", "url": "F8wY_0q5yns", "title": "Fixing Serve Mechanics: From Downward Push to True Rotation", "description": "This video explains the real reason most players can’t generate power on the serve. I break down the 3 planes of motion, why “serving down” kills rotation, and how this leads to problems...", "duration": 778.0, "view_count": null, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "67ubpXoQfB8", "url": "67ubpXoQfB8", "title": "Why Your Second Serve Is Inconsistent (Video Analysis)", "description": "Most second-serve problems don’t come from lack of effort or confidence — they come from a toss that makes topspin impossible. In this side-by-side video analysis, I break down why the...", "duration": 1006.0, "view_count": null, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "BkJSJO4xHfQ", "url": "BkJSJO4xHfQ", "title": "Core Activation / Warm Up Drill With A Stick", "description": "I use all sorts of tools to help players feel their core better and the rotation overall. The pilates stick is a good way to engage the core as it's heavy enough to make you feel core muscles engage.", "duration": 136.0, "view_count": null, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "oPc8OJkG-zw", "url": "oPc8OJkG-zw", "title": "Why Your Tennis Forehand Breaks Down More Than Your Backhand", "description": "In this tennis lesson for adult recreational players, I explain why the forehand is actually more complicated than the backhand — and why it tends to break down more often in matches.\n\nAlthough...", "duration": 1007.0, "view_count": 27937, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "EymE8WMvP84", "url": "EymE8WMvP84", "title": "The Real Purpose of Footwork And \"Getting Into Position\" Explained", "description": "This clip reveals a deeper insight into the real purpose of footwork — not just reaching the ball, but positioning yourself to hit the one forehand you’ve practiced millions of times, with...", "duration": 420.0, "view_count": null, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "VKD1otbnn28", "url": "VKD1otbnn28", "title": "Feeling Super Relaxed Forehands Today - Hitting With Urban", "description": "Felt super relaxed and quick today! ⚡️ The forehands felt totally effortless and even the backhand worked perfectly. It’s amazing how much our mood impacts the game. I have an open week...", "duration": 198.0, "view_count": null, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "DfBF-Xtbo_4", "url": "DfBF-Xtbo_4", "title": "Flat vs Topspin Forehand - And Why Hitting With Topspin Is Difficult", "description": "This is a comparison of a flat and a topspin forehand recorded in super slow motion where I demonstrate how much more difficult it is to hit the sweet spot when accelerating upwards into topspin.", "duration": 435.0, "view_count": null, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "sqmDmMBlZHg", "url": "sqmDmMBlZHg", "title": "Tennis Body Volley: Why You Get Jammed & How to React Faster", "description": "One of the trickiest volleys to handle in tennis is the body volley, as players get jammed by the ball very often. In this lesson, I'll show you exactly why balls hit at your body are so hard...", "duration": 316.0, "view_count": 4837, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "E31fyqL5nJE", "url": "E31fyqL5nJE", "title": "Perfect Forehand Volley Technique by Federer (Good Old Times)", "description": "Roger Federer demonstrating perfect basic forehand volley technique - the same way I like to teach players to keep the strings pointing long towards the target. \n\nFull video (with the volley...", "duration": 113.0, "view_count": null, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "TCy7SdETk4A", "url": "TCy7SdETk4A", "title": "When You Truly See the Ball, You Unlock Effortlessness", "description": "In this lesson, I share a simple but powerful realization about how we see the ball. Once my student understood this, his backhand became effortless — not because of technique, but because...", "duration": 566.0, "view_count": null, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "skJm-zpDfPE", "url": "skJm-zpDfPE", "title": "How to Play Smarter Tennis Using Pro-Level Stats", "description": "In this video, I break down real pro-level statistics from Grand Slam matches—Australian Open, Wimbledon, and Roland Garros—to show you what actually wins matches at every level.\n\nMost...", "duration": 792.0, "view_count": 3515, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "xzFTxKMtI_w", "url": "xzFTxKMtI_w", "title": "The Forehand Consistency Blueprint: Technique, Targets, and Toughness", "description": "In this lesson, I walk you through the full blueprint for building a forehand you can actually rely on. We’ll look at the technical pieces that keep your swing stable, the targeting ideas...", "duration": 1333.0, "view_count": null, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "8QTGaEQp5_A", "url": "8QTGaEQp5_A", "title": "The “Green Box” Concept – Why You Don’t Need to Look at Your Opponent", "description": "Learn the Green Box concept — a simple way to stop watching your opponent and finally focus on the ball. Once you understand where opponents recover, your mind relaxes, your tracking improves,...", "duration": 879.0, "view_count": null, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "M1fC1PkHgp0", "url": "M1fC1PkHgp0", "title": "Tennis Serve Weight Transfer: The #1 Mistake and How to Fix It", "description": "Most players completely misinterpret tennis serve weight transfer — and it destroys their power, rhythm, and lower-back health. In this video, I’ll show you exactly what’s really happening...", "duration": 733.0, "view_count": 13457, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "RMQQKZRlrVE", "url": "RMQQKZRlrVE", "title": "Junior Match Analysis - The Hard Truths About Winning", "description": "Even when you play well, tennis rarely feels easy. You still lose half the points. You still miss. You still suffer through doubt, pressure, and discomfort. But that’s not a sign you’re...", "duration": 2243.0, "view_count": null, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "9ASKwQ3bF_8", "url": "9ASKwQ3bF_8", "title": "A Realistic Way To Practice Volleys - And Why It's A Long Journey", "description": "In this Members Short, I answer a few questions from a Member asking me various questions about the volleys. I explain how to train volleys for long-term improvement — developing timing,...", "duration": 897.0, "view_count": null, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "zOipgBUDauQ", "url": "zOipgBUDauQ", "title": "What Jannik Sinner Can Teach You About Warming Up the Right Way", "description": "Ever wonder why you can’t find your rhythm in the first few minutes of hitting? You’re probably standing too close! In this clip, I break down how Yannick Sinner warms up meters behind...", "duration": 116.0, "view_count": null, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "swXmgudsFiY", "url": "swXmgudsFiY", "title": "Weight Transfer Done Right — 2 Lesson Examples", "description": "Two lesson examples that reveal what real tennis weight transfer looks like — one on the forehand, one on the backhand. You’ll see how proper hip rotation and controlled foot drag help...", "duration": 660.0, "view_count": null, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "0UzbVNFOThE", "url": "0UzbVNFOThE", "title": "Tennis Serve Power: Myth vs. Reality", "description": "Most players believe tennis serve power comes from pronation, complex wrist movements, or perfect technique — but that’s a myth. In this video, I reveal the reality behind how to serve...", "duration": 684.0, "view_count": 9288, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "kGzHlnp4fEE", "url": "kGzHlnp4fEE", "title": "Busting the Weight Transfer Myth Once and for All", "description": "Most players still believe that stepping into the ball creates more power — but that’s one of the biggest myths in tennis. In this video, I break down what really happens during a forehand...", "duration": 1695.0, "view_count": null, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "bVcTHVdmAtY", "url": "bVcTHVdmAtY", "title": "Footwork Deep Dive: From Dancing on Your Feet to Explosive Pivots", "description": "In this video, I’ll show you how being light on your feet, the split step, and the pivot all fit together in real play. You’ll see when each movement actually happens, why you don’t always...", "duration": 840.0, "view_count": null, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "j_ZqCfSHw3I", "url": "j_ZqCfSHw3I", "title": "The Real Secret to Moving Faster on Court (It’s Not Sprinting!)", "description": "Most players think they need to sprint faster to move better on the court — but that’s not where real speed comes from. In this session, you’ll learn how to improve your first step and...", "duration": 1007.0, "view_count": null, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "2D7UlPQHce4", "url": "2D7UlPQHce4", "title": "Tennis Forehand Wrist Action: Slap vs Snap Explained", "description": "In this video, I’ll show you exactly what I mean when I talk about slapping the ball in tennis especially on the forehand. Many players misunderstand this concept and end up pushing the ball...", "duration": 852.0, "view_count": 59478, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "ZTHWa_mZJRw", "url": "ZTHWa_mZJRw", "title": "Open vs. Neutral Stance Forehand: What Skilled Players Really Use", "description": "It's likely that you've heard coaches say, \"Step into the ball for more power.\" But do good players actually do that? I'll show you actual footage of four seasoned players, including myself,...", "duration": 1061.0, "view_count": null, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "tS3t-SoFxOs", "url": "tS3t-SoFxOs", "title": "The 3 Key Forehand Footwork Patterns Explained", "description": "In this video, I break down the 3 key forehand footwork patterns every player needs to understand. You’ll see how neutral and two variations of the open stance actually work in rallies, why...", "duration": 676.0, "view_count": null, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "yqbXj-qo7nw", "url": "yqbXj-qo7nw", "title": "Kick Serve Mastery: Technique, Drills, and Smart Practice", "description": "In this session, I’ll show you how I work on the kick serve — a mix of technique, simple drills, and a smart practice structure that really helps the serve stick. You’ll see how to train...", "duration": 964.0, "view_count": null, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "7NYFZbH0Ga4", "url": "7NYFZbH0Ga4", "title": "Tennis Drop Volley - 3 Drills to Develop Soft Hands at the Net", "description": "The tennis drop volley is one of the hardest shots to master—especially if you’ve spent years being told to “punch” every volley with a firm wrist.\n\nIn this video, I’ll show you how...", "duration": 456.0, "view_count": 7772, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "ih_Z0Ymx6_w", "url": "ih_Z0Ymx6_w", "title": "Why You Must Abandon Perfect Technique to Control the Ball", "description": "In this video, I show you why chasing perfect technique actually holds you back. Through a simple “yes/no” drill, you’ll see how true ball control comes from clear intention and solid...", "duration": 371.0, "view_count": null, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "n-ns8luJtAQ", "url": "n-ns8luJtAQ", "title": "How to Combine Effortless Power and Consistency – Slap & Push Explained", "description": "In this session I show you the slap & push idea and why it’s so important for all groundstrokes. The slap gives you that easy power, while the push adds control so the ball stays in the court....", "duration": 733.0, "view_count": null, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "2gS7Xy1iMgQ", "url": "2gS7Xy1iMgQ", "title": "Effortless Two-Handed Backhand: Lever Mechanics Part 2", "description": "This is part two of the two-handed backhand lever drill. I’ll show you how to practice it, with Andrei demonstrating as well. The key is learning how the hands work together so your backhand...", "duration": 465.0, "view_count": null, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "wda29YZ6VKc", "url": "wda29YZ6VKc", "title": "One-Handed Backhand Down the Line: 7 Tennis Tips for Better Accuracy", "description": "The one-handed backhand down the line is one of the most beautiful — but also one of the most difficult — shots in tennis. Many players struggle with accuracy and end up hitting too much...", "duration": 786.0, "view_count": 17104, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "JN5YuBp8ElU", "url": "JN5YuBp8ElU", "title": "Two-Handed Backhand Power: Mastering the Lever Flip - Part 1", "description": "The two-handed backhand can feel tricky if you’re trying to muscle the ball. In this video, I’ll show you a simple “lever flip” drill that helps you feel the right motion and unlock...", "duration": 412.0, "view_count": null, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "x-3dp83pRds", "url": "x-3dp83pRds", "title": "Are You Helping Your Opponent Win? (A Mental Lesson Every Player Needs)", "description": "Your opponent's skill level is fixed for the day, but their performance depends entirely on their mental state. The biggest mistake you can make on the court is to feed their confidence. In...", "duration": 609.0, "view_count": null, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "WXyzSxUhExo", "url": "WXyzSxUhExo", "title": "Tennis Forehand Slice Technique: The Most Versatile Shot You’re Not Using", "description": "Is the forehand slice part of your tennis arsenal—or are you leaving points on the table? Mastering the forehand slice technique and applying it in key tactical situations can give you a...", "duration": 835.0, "view_count": 17794, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "ch09J2B1tSs", "url": "ch09J2B1tSs", "title": "Fix Your Forehand: 10 Forehand Fundamentals with the Ball Machine", "description": "In this Members-only session, I demonstrate how to use a ball machine to work on 10 key fundamentals of the forehand. I’m playing left-handed to give my client the correct perspective (since...", "duration": 397.0, "view_count": null, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "OJQR2oVgkGc", "url": "OJQR2oVgkGc", "title": "Why You Don’t Need “Perfect” Technique to Serve Powerfully", "description": "You don’t need perfect grip, textbook swing paths, or pro-level form to hit a powerful tennis serve. In this video, I show you two real examples of players generating serious power through...", "duration": 449.0, "view_count": null, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "5rTG-uxWmsg", "url": "5rTG-uxWmsg", "title": "How to Hit Topspin In Tennis with Power (Without Brushing Up)", "description": "When you're learning how to hit topspin in tennis, the most common instruction you'll hear is to “brush up\" the ball. Unfortunately, this is one of the most misleading tips in tennis when...", "duration": 833.0, "view_count": 381591, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "v83PS5n77dA", "url": "v83PS5n77dA", "title": "Forehand Drill For Better Engagement Of The Non-Dominant Arm", "description": "One of the more common issues on the forehand tennis stroke is that the non-dominant arm is just hanging down the body and does not coordinate well with the hitting arm. In this video I explain...", "duration": 383.0, "view_count": null, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "uvuX7DnEteI", "url": "uvuX7DnEteI", "title": "One-Handed Backhand Footwork Drills For Smooth Movement", "description": "The one-handed backhand footwork drills in this video show a practical way of implementing what you've learned in the public video that explains different footwork patterns. https://youtu.be/yZ7SwL...", "duration": 452.0, "view_count": null, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "yZ7SwLFWwdw", "url": "yZ7SwLFWwdw", "title": "One-Handed Backhand Footwork: Smart Tennis Movement for Recreational Players", "description": "One-handed backhand footwork is the key to hitting accurate, controlled shots from anywhere on the tennis court. Free course: https://www.feeltennis.net/1h-backhand-course/\n\nWhile you may assume...", "duration": 698.0, "view_count": 12311, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "3D0dXKwwNe0", "url": "3D0dXKwwNe0", "title": "The Most Powerful Forehand Drill I Use Every Week", "description": "This 2-minute video may be short—but it's one of the most effective drills I’ve ever developed for fixing forehand biomechanics in adult recreational players. Using elastic bands and a...", "duration": 275.0, "view_count": null, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "8n7TfLMck3o", "url": "8n7TfLMck3o", "title": "How Clear Intention Improves Ball Control And Your Technique", "description": "In this follow-up to last week’s video on the Decision & Execution Cycle https://youtu.be/JobYrqEWT-o), we dive deeper into the power of clear intention during a point. Most players think...", "duration": 795.0, "view_count": null, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "kEu4JKckFDA", "url": "kEu4JKckFDA", "title": "Core Power in Tennis: Core Swagger Device Put to the Test", "description": "👉 Get the FeelTennis Discount here → http://bit.ly/4ltMJge\n🎁 Includes a FREE biomechanics course when you order!\n\nIn this video, I review the Core Swagger (Reactive Sports Device) and...", "duration": 690.0, "view_count": 4351, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "JobYrqEWT-o", "url": "JobYrqEWT-o", "title": "The Secret to Staying Calm During a Point", "description": "Most players feel stressed during points because their mind is trying to play the whole point at once. In this short video, I explain a simple shift that can change everything—focusing on...", "duration": 977.0, "view_count": null, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "XPp1_6JAxmo", "url": "XPp1_6JAxmo", "title": "Perfect Backhand Slice Technique Analyzed In Slow Motion", "description": "In this video I am analyzing close to perfect backhand slice technique demonstrated by my friend Urban. He has mastered all tennis strokes but his one-handed backhand slice shot may he his...", "duration": 1862.0, "view_count": null, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "xavfTwDCcqI", "url": "xavfTwDCcqI", "title": "Top 0.1% One-Handed Backhand Technique At Club Level Analyzed", "description": "My friend Urban's one-handed backhand technique is probably in the top 0.1% of the recreational level of tennis. In this video I go over the key technical points of what makes his one-handed...", "duration": 1427.0, "view_count": null, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "SpL8sIv1eS8", "url": "SpL8sIv1eS8", "title": "Tennis Deep Volley Technique: Slice, Height, and Control", "description": "Mastering a deep volley in tennis is the key to dominating the net game both in singles and doubles. Hitting deep volleys with precision is what sets up the final finishing \"punch\" volley or...", "duration": 974.0, "view_count": 8121, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "vgoR1Kb7CEI", "url": "vgoR1Kb7CEI", "title": "Tennis Unit Turn: Head vs Shoulders Perfect Demonstration", "description": "In this video, I explain the importance of the tennis unit turn and how it impacts your forehand. You'll see two common mistakes that create timing issues and rob your forehand of energy —...", "duration": 406.0, "view_count": null, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "85QfeQo3ooA", "url": "85QfeQo3ooA", "title": "How To Overcome The Fear Of Missing In Tennis", "description": "The fear of missing in tennis combined with the stiff arm that we feel when we attempt a shot is something that can really hurt your game and frustrate you endlessly. In this video I explain...", "duration": 1193.0, "view_count": null, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "1btQPSDRLok", "url": "1btQPSDRLok", "title": "How I Conquered My Mind on the Tennis Court", "description": "Here’s a summary of the whole talk (I used AI for that) that highlights the key moments and my realizations from my journey...\n\nLet me share my story about how I gradually learned to conquer...", "duration": 2897.0, "view_count": null, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "xYYbwLjXeV4", "url": "xYYbwLjXeV4", "title": "One Handed Backhand in Open Stance | Tennis Technique & Strategy Guide", "description": "The one-handed backhand in open stance is one of the toughest strokes in tennis when it comes to generating power and maintaining control.\n\nWhile open stance forehands and two-handed backhands...", "duration": 740.0, "view_count": 14979, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "zQDwwJhLLW0", "url": "zQDwwJhLLW0", "title": "How To Hit The Ball Clean And Accurate (With Drills)", "description": "When your tennis stroke technique is already quite good but you still sometimes struggle to control the ball, you may need to \"polish\" the stroke more and work on hitting the ball more cleanly....", "duration": 884.0, "view_count": null, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "DsNo_8qaAh8", "url": "DsNo_8qaAh8", "title": "Why I Stopped Competing In Tennis 20 Years Ago", "description": "I stopped playing competitive tennis exactly 20 years ago at the age of 33. I explain in this video how I found fulfillment and realized what the actual purpose of competitive sport is. A related...", "duration": 405.0, "view_count": null, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "HqQlNcfnXUE", "url": "HqQlNcfnXUE", "title": "Tennis Low Volley Guide: Technique, Footwork & Smart Tactics", "description": "Struggling with low volleys in tennis? You’re not alone — and today, we’re fixing that.\n\nIn this video, I break down the 5 most common mistakes players make with low volleys — and more...", "duration": 814.0, "view_count": 11347, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "JS3WcfTkJLQ", "url": "JS3WcfTkJLQ", "title": "How To Time The Ball Perfectly In Tennis And Stop Hitting Late", "description": "One of the biggest problems for recreational players is hitting the ball too late. When you're late, you lose power, you lose control — and it just feels off. The real issue isn’t your...", "duration": 763.0, "view_count": null, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "VLoTdbA_l5o", "url": "VLoTdbA_l5o", "title": "How To Feel Forehand Shoulder Rotation And Connected Shoulders", "description": "In this video I share another way of helping the player feel upper body and shoulder rotation by me providing resistance against the upper part of the non-dominant arm. I've shared another...", "duration": 876.0, "view_count": null, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "QkFcW4TKK0g", "url": "QkFcW4TKK0g", "title": "Tennis Forehand Footwork Coordination Drills In 4 Directions", "description": "The following forehand footwork coordination drills are part 2 of my tennis sessions with Greg working on his forehand. You will find link to part 1 below where we worked more on leg drive...", "duration": 1355.0, "view_count": null, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "kR6oEoETcY0", "url": "kR6oEoETcY0", "title": "Get Your Legs Ready for Tennis: Pre-Practice Warm-Up Drills", "description": "Using your legs well in tennis the key to effortless power and very good ball control as the kinetic chain runs from bottom - up. While I've shared this leg activation warm up routine before,...", "duration": 945.0, "view_count": null, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "iAYDIVqeYE4", "url": "iAYDIVqeYE4", "title": "Best Tips for Deep Tennis Volleys and Accurate Placement", "description": "If you're struggling to hit deep and accurate volleys then these 3 tennis tips for better volley control will get you on the right track. \n\nHere's how you can improve your forehand and backhand...", "duration": 641.0, "view_count": 9186, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "zlk-BqvXTLA", "url": "zlk-BqvXTLA", "title": "Feel the Natural Forehand Swing: 3 Biomechanical Steps", "description": "This video breaks down the forehand swing into biomechanical foundations which take just 3 steps. First, we explore the basic pendulum-like motion of the arm, we then add the hip and body rotation...", "duration": 524.0, "view_count": null, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "bR0RItOKcM0", "url": "bR0RItOKcM0", "title": "The Most Important Skill in Tennis - Accuracy Of Time & Space", "description": "This video dives into the often-overlooked keys to improving your tennis game: the accuracy of timing and the accuracy of hitting the sweet spot. These are two \"invisible\" skills that separate...", "duration": 2036.0, "view_count": null, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "PWMhJmzd6Ao", "url": "PWMhJmzd6Ao", "title": "Tennis Volley Tips For Extra Power & Control  - It’s All About Body Mass", "description": "The following tennis volley tips show you how to use your body weight effectively to get more power and better control of your volleys. Busting volley myths course: https://www.feeltennis.net/volle...", "duration": 477.0, "view_count": 10791, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "6eTxZdT4o3g", "url": "6eTxZdT4o3g", "title": "How To Handle Fast Balls In Tennis Masterclass (37 minutes)", "description": "If you're struggling to handle fast tennis balls then this masterclass video is for you as it explains why you miss a lot and how to control fast incoming balls better.\n\nHere's a quick summary...", "duration": 2243.0, "view_count": null, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "uvmjtGb8GS8", "url": "uvmjtGb8GS8", "title": "Stop Hitting Volleys Late! - Tennis Volley Tips Part 1", "description": "If you're hitting tennis volleys late, then these tips and drills will help you hit volleys well in front. Free volley course: https://www.feeltennis.net/volley-course/\n\nThis is part 1 of the...", "duration": 320.0, "view_count": 9747, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "CWhUow_FxfE", "url": "CWhUow_FxfE", "title": "How Tennis Technique Evolves Based On The Playing Conditions", "description": "In most cases the flaws in your tennis stroke technique developed because you played in conditions that caused you trouble and your mind and body tried to find a solution. This is important...", "duration": 596.0, "view_count": null, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "4ixhlmdO2JI", "url": "4ixhlmdO2JI", "title": "Why It Always Comes Down To Hips In Tennis", "description": "Engaging more of your hips / pelvis in the shot is the key for hitting more effortless tennis strokes including the serve. In this video I explain one simple way you can practice better hip...", "duration": 772.0, "view_count": null, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "SXGrCkYcf4c", "url": "SXGrCkYcf4c", "title": "Tennis Backhand Volley Technique - 5 Checkpoints For Precise Volley Control", "description": "If you’re looking to master the tennis backhand volley technique with all the essential technical checks, this guide is for you. Full Volley & Smash course: https://www.feeltennis.net/volley-and-...", "duration": 558.0, "view_count": 11271, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "LcE7C7h0kzU", "url": "LcE7C7h0kzU", "title": "Why You Should Practice With Different Tennis Balls?", "description": "There are several benefits of practicing with different types of balls, by that I mean soft foam balls, bigger balls for kids and medium hard tennis balls. One benefit is better ability to...", "duration": 1189.0, "view_count": null, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "nFjFteyhyCA", "url": "nFjFteyhyCA", "title": "Can you see LiveStream info? 6.15 PM GMT+1 zone", "description": "Just checking if you see the live stream info for today 6.15 PM GMT+1 or Slovenia time zone, that's also 12.15 ET time for US.", "duration": 46.0, "view_count": null, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "DoxgjejOQ-U", "url": "DoxgjejOQ-U", "title": "Forehand Open Stance Tips For Easy Power", "description": "The key to hitting an effortless open stance forehand in tennis is to load the outside leg well and use it to drive the force upwards. But that's quite a tricky thing to do in a very limited...", "duration": 379.0, "view_count": null, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "-R3NfN5Bbkw", "url": "-R3NfN5Bbkw", "title": "Tennis Forehand Volley Technique Explained In 5 Steps", "description": "The following tennis forehand volley technique video covers all the key checkpoints of the forehand volley but if you to really master it, check out the full course: https://www.feeltennis.net/voll...", "duration": 650.0, "view_count": 14989, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "Mcr5PbzDy5A", "url": "Mcr5PbzDy5A", "title": "Better Posture, Better Tennis: The Key To Good Ball Control", "description": "Tennis players tend to reach and lean often to get to the ball instead of moving with their feet to the ball. They are unaware how detrimental this is to their game in terms of ball control...", "duration": 847.0, "view_count": null, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "ntFG9io5BYw", "url": "ntFG9io5BYw", "title": "Feel the Weight, Unleash the Power: A New Way to Think About Tennis", "description": "In this video I am coaching my student Andrei how to prepare his forehand tennis stroke more with non-dominant side of the body so that there is no \"backswing\" but just body rotation. And in...", "duration": 1076.0, "view_count": null, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "cwwKLLw9mII", "url": "cwwKLLw9mII", "title": "Why More Topspin In Tennis Won't Work For You", "description": "Tennis players tend to become obsessed with hitting with more topspin on their forehands and backhands as if that's the holy grail that will hit every ball in. The problem with that approach...", "duration": 718.0, "view_count": 25728, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "yxSTmiuYVxs", "url": "yxSTmiuYVxs", "title": "Why Topspin Ruins Your Tennis Fundamentals (And How to Fix It)", "description": "You have been told thousands of times by tennis coaches to hit with more topspin as if that is the holy grail of tennis that will give you zero unforced errors. The truth is that applying topspin...", "duration": 542.0, "view_count": null, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "D2BQ7d_WNVo", "url": "D2BQ7d_WNVo", "title": "How Letting Go Of Control Develops Effortless Tennis", "description": "Most tennis players can control the ball quite well if they want to but they don't like the feeling of tension in their arm. The path to effortless tennis is a long one and it has one simple...", "duration": 1046.0, "view_count": null, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "fTX-Z7Ebtp4", "url": "fTX-Z7Ebtp4", "title": "Tennis Approach Shot Guide - Technique, Footwork & Timing Tips", "description": "If you’re looking to master the tennis approach shot, this video is for you. You'll learn how to hit aggressive topspin forehand approach shots, the best footwork to use, and the ideal timing...", "duration": 719.0, "view_count": 12537, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "xSuDf1aYztY", "url": "xSuDf1aYztY", "title": "How High Level Tennis Players Hit Topspin Effortlessly", "description": "When you want to hit a topspin forehand or backhand in tennis at higher levels you need to stop \"doing\" the topspin and instead learn how to \"make it happen\". Watch Grigor Dimitrov's forehands...", "duration": 950.0, "view_count": null, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "awYl86mkZu8", "url": "awYl86mkZu8", "title": "Kinetic Chain In Tennis And How To Apply It In Practice", "description": "You've all heard about the kintetic chain in tennis and how it helps you generate effortless power but that's just the theory. How can you apply the kinetic chain in your actual tennis game?...", "duration": 616.0, "view_count": null, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "vZ5aWXoSStE", "url": "vZ5aWXoSStE", "title": "How To Approach The Net In Tennis - Cross vs Down The Line", "description": "If you're not sure how to approach the net in tennis when it comes to direction of your approaches or the right targets, then this video is for you. I've prepared a series of videos based on...", "duration": 319.0, "view_count": 6389, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "gVL-QDXIGk0", "url": "gVL-QDXIGk0", "title": "Feel The Right Tennis Volley Swing Path Using A Simple Drill", "description": "How can we help a tennis player feel the right volley swing path better in a short amount of time? You can use the \"reverse path\" drill which I showed to my student Allen who quickly grasped...", "duration": 880.0, "view_count": null, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "htLslcohtDQ", "url": "htLslcohtDQ", "title": "Forehand Wrist Action - How Does Flexion Happen?", "description": "One of my members wanted to know how does wrist flexion happen on the forehand after the contact. The answer is - it depends on your intention and what kind of incoming ball you're receiving....", "duration": 906.0, "view_count": null, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "vvyzMNbN-5s", "url": "vvyzMNbN-5s", "title": "How Do We Control The Ball In Tennis? PAS Principle Explained", "description": "So how do we control the ball in tennis? Players usually answer with topspin but it's not the primary way we control the ball - we control it through height and speed and we possibly add topspin...", "duration": 1148.0, "view_count": null, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "IS8Wl3xsaW8", "url": "IS8Wl3xsaW8", "title": "Tennis Serve Lesson for Beginners: 5 Drills To Get Started", "description": "This tennis serve lesson for beginners introduces fundamental serving drills featured in our free course: https://www.feeltennis.net/serve-challenge/\n\nSince we obviously cannot learn a complete...", "duration": 997.0, "view_count": 12151, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "gxXnTXfurMA", "url": "gxXnTXfurMA", "title": "How Forehand Wrist Stability Depends on Your Aim", "description": "My student Allen was wondering how stable should the wrist be when hitting a tennis forehand. In this video you'll see what happens with the wrist during the hitting phase of a typical rally...", "duration": 1126.0, "view_count": null, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "-Mpo80kJxtg", "url": "-Mpo80kJxtg", "title": "How To Improve The Slice & Volley With A Single Drill", "description": "The slice, the volley and the drop shot are all from the same family of tennis strokes - namely based on the slice or backspin. Each variation of this stroke emphasizes one element more than...", "duration": 405.0, "view_count": null, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "t8MNiQPJ4Fo", "url": "t8MNiQPJ4Fo", "title": "Core and Hip Rotation Drills for a More Powerful Tennis Serve", "description": "In this video I show several drills that improve the core and hip rotation to get more power on the serve. My student Alex was arching his back too much and not engaging body rotation enough...", "duration": 749.0, "view_count": null, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "28TzrQUxn3w", "url": "28TzrQUxn3w", "title": "Stop Missing Forehands: Mental and Technical Insights", "description": "In this video, I’m diving into an in-depth analysis of a forehand sent to me by a fellow tennis coach who wanted advice on why their player was struggling with this stroke. This analysis...", "duration": 1720.0, "view_count": null, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "sajE0S_VDO4", "url": "sajE0S_VDO4", "title": "Tennis Masterclass - How To Play Tennis Explained In 36 Minutes", "description": "This is my masterclass I gave at a tennis clinic in Mallorca / Spain where I explained how to play tennis. By that I mean that I included explanations of rhythm, timing and technique which...", "duration": 2184.0, "view_count": null, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "Y6e7qUwPDOg", "url": "Y6e7qUwPDOg", "title": "Tennis Warm Up  - Lines Drill", "description": "A simple and effective tennis warm up using the singles and doubles sidelines to warm up and improve many different footwork patterns. This footage is from a tennis clinic in Mallorca Spain...", "duration": 919.0, "view_count": null, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "Q7Rejj-VXWA", "url": "Q7Rejj-VXWA", "title": "My TOP 5 Tennis Forehand Tips That Give You Laser Guided Accuracy", "description": "The tennis forehand tips shared above will help you hit much more consistent forehands. But if you struggle with power, sign up for this free course: https://www.feeltennis.net/forehand-power-cours...", "duration": 1306.0, "view_count": 105641, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "J9kM6mQ1puQ", "url": "J9kM6mQ1puQ", "title": "The Counterintuitive Way To Learning High Level Tennis", "description": "This is my interview with Pete Freeman for the annual Tennis Con (https://bit.ly/tenniscon) where we talk about 3 ways of developing higher level tennis skills: accepting mistakes as part of...", "duration": 2908.0, "view_count": null, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "VmMJdaSdYxU", "url": "VmMJdaSdYxU", "title": "Does Jannik Sinner Play Risky Or Safe Tennis?", "description": "Tennis players usually play either too risky or too safe and are confused on how exactly to manage their risk. So let's use Jannik Sinner's win at the 2024 US Open and look at this stats to...", "duration": 441.0, "view_count": null, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "3GtXlml8v1Q", "url": "3GtXlml8v1Q", "title": "The Abbreviated Tennis Serve And Why I Don't Recommend It", "description": "Tennis players sometimes use the so called abbreviated backswing on their serves instead of a backswing. There is one major problem with this type of serve technique and I point it out in this...", "duration": 1098.0, "view_count": null, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "olip5lI16Ew", "url": "olip5lI16Ew", "title": "The Simplest Tennis Consistency Drills For Groundstrokes", "description": "Consistency is the name of the game in tennis and these simple drills are a good way to test your consistency levels. You'll play forehands and backhands down the line and cross court and measure...", "duration": 836.0, "view_count": null, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "esJqF5RWrDk", "url": "esJqF5RWrDk", "title": "Two-Handed Backhand Drills For More Wrist Lag Power", "description": "One of the main challenges for tennis players that hit a two-handed backhand is the lack of the wrist lag. They tend to do all the work with their arms while having stiff wrists. In this video...", "duration": 1240.0, "view_count": null, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "eD6dT0Qgcc0", "url": "eD6dT0Qgcc0", "title": "Sportbot Review - World's First Moving Tennis Ball Machine", "description": "The Sportbot tennis ball machine is available at early bird launch price here: https://bit.ly/4dtZnY4\n\nIn my review of the Sportbot tennis ball machine I found out that it really is the most...", "duration": 852.0, "view_count": 19912, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "MstJRlD6_kI", "url": "MstJRlD6_kI", "title": "Tennis Volley Drills For Better Control & Depth", "description": "Tennis players often struggle with depth on their volleys especially on the forehand volley. Usually volley myths hold them back: https://www.feeltennis.net/volley-course/ In this video I'll...", "duration": 987.0, "view_count": null, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "Q__J9Ii_S_s", "url": "Q__J9Ii_S_s", "title": "Volley To Volley Drill For Better Ball Control & Accuracy", "description": "One of my favorite tennis drills for developing volley ball control, feel and accuracy is this volley to volley drill where both players aim at the opponent's racket. This volley drill serves...", "duration": 401.0, "view_count": null, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "cKnYJxIN_6k", "url": "cKnYJxIN_6k", "title": "How To Win Tennis Matches By Better Decision Ratio", "description": "Playing tennis matches can be very stressful to players because they focus on each point and try to win it. But in a single match you will play around 100 points and have to make around 400...", "duration": 255.0, "view_count": null, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "D0Ckul9iDRI", "url": "D0Ckul9iDRI", "title": "Tennis Serve Technique In Slow Motion From Top View", "description": "A detailed analysis of tennis serve technique in slow motion from top down view including the flat, topspin / kick and slice serves. Effortless Serve in 30 Days: https://www.feeltennis.net/serve-ch...", "duration": 812.0, "view_count": 22530, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "s_rGoVFzbbc", "url": "s_rGoVFzbbc", "title": "Where To Aim Short Cross Court Shots In Tennis?", "description": "Most tennis players tend to aim too short when going for a short cross court shot. This video explains the guidelines to use for choosing the angle of your cross court shots and from which...", "duration": 750.0, "view_count": null, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "3x-QTQmtLSA", "url": "3x-QTQmtLSA", "title": "The Key To Mental Tennis Toughness - Sustaining The Pressure", "description": "What does it really mean to be mentally tennis tough? The first condition is of course the be physically tough so that you can sustain longer rallies but the other condition is to mentally...", "duration": 1060.0, "view_count": null, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "0R49HKRVFIg", "url": "0R49HKRVFIg", "title": "Serve Challenge Day 3 Drills Example", "description": "This video shows Serve Challenge Day 3 Drills, register here: https://tinyurl.com/30dayserve\n\nThis will give you a better idea of what to expect inside the community platform. If you haven't...", "duration": 1407.0, "view_count": null, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "qRzTJGHEfVg", "url": "qRzTJGHEfVg", "title": "Tennis Volley Technique In Slow Motion - Top Down / Drone View", "description": "A unique footage of the tennis volley technique in slow motion from the top down / drone view that allows you analyze forehand and backhand volleys in great detail. Unlock your volleys now:...", "duration": 681.0, "view_count": 11675, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "1H4hDlDpkSs", "url": "1H4hDlDpkSs", "title": "Simple Tennis Doubles Tips For High Percentage Plays", "description": "What are some simple tennis doubles tips that helps you play high percentage tennis? This video shows the highest probability shot for each of the 4 positions on the court. I will also share...", "duration": 761.0, "view_count": null, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "fV6-MQdLMbk", "url": "fV6-MQdLMbk", "title": "How To Practice Early Decision Making In Tennis", "description": "In a tennis match, it's important to make early decisions so that you have enough time to get into the right position and align your body for the perfect shot. In this video, I demonstrate...", "duration": 1412.0, "view_count": null, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "nyF7y4xflFE", "url": "nyF7y4xflFE", "title": "Why You Should Never Try To Hit Winners", "description": "Learning why you should never try to hit winners in tennis may be the most important and counterintuitive topic in tennis strategy. Once you understand this, it may change your tennis life...", "duration": 1372.0, "view_count": null, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "I3nEIC2uim8", "url": "I3nEIC2uim8", "title": "How To Improve Your Tennis Skills In The Long Term", "description": "This is how I improved my tennis skills over the period of close to 40 years. I have been playing like this since the age of 12, obviously not at the same skill level but with the same approach....", "duration": 1949.0, "view_count": null, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "WPuWVWRXwTc", "url": "WPuWVWRXwTc", "title": "Tennis One-Handed Backhand Technique In Slow Motion - Top View", "description": "Ever wanted to see a tennis one-handed backhand technique in slow motion from the top down / drone view? And here's a free course if you struggle with the backhand: https://www.feeltennis.net/1h-ba...", "duration": 954.0, "view_count": 19385, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "5UilqrRMS88", "url": "5UilqrRMS88", "title": "What Shot To Play If You Don't Want To Approach The Net?", "description": "What if you don't want to approach the net even though you have a short ball? In this video I'll show you what's the best shot to play, the logic behind it and I'll suggest two more options...", "duration": 249.0, "view_count": null, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "sdcVd0ja7i8", "url": "sdcVd0ja7i8", "title": "Nisplay N2 Tennis Ball Machine Review", "description": "I've had the chance to review the Nisplay N2 tennis ball machine and I am glad to report that it's a great addition to the ball machine market. https://nisplaysports.com/ - Use coupon code...", "duration": 1255.0, "view_count": 22715, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "UUzAFZrJXas", "url": "UUzAFZrJXas", "title": "What Are The LUCKY Shots In Tennis?", "description": "The key to playing tennis tactically well is to know what is a realistic target area you should aim at and what shots here and there end up as lucky ones. Because if you don't recognize them...", "duration": 946.0, "view_count": null, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "BEVOYNu-Umw", "url": "BEVOYNu-Umw", "title": "Tennis Serve Lesson With 8 Year Old Boy - Beginner Serve Development", "description": "In this tennis serve lesson, you will see an 8 year old boy practice his serve with basic drills that develop good throwing motion and pronation. You can apply many of these serve drills in...", "duration": 1151.0, "view_count": null, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "7GQ8zEb3Hx0", "url": "7GQ8zEb3Hx0", "title": "When NOT To Hit A Heavy Ball In Tennis", "description": "While most tennis players want to know how to hit a heavy ball, it is also important to know when not to attempt a heavy topspin ball as it can be too risky. So in this video you'll see a couple...", "duration": 409.0, "view_count": null, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "icCNdZ6iSzo", "url": "icCNdZ6iSzo", "title": "Tennis Returns Of Slow & Easy Serves - Offensive Return Lesson", "description": "What's the best tennis return attacking tactic of slow and easy serves? While you may think hitting an offensive return winner is best, that's not a high percentage tennis.\n\nhttps://www.feeltennis....", "duration": 750.0, "view_count": 31980, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "euucG3kfdgk", "url": "euucG3kfdgk", "title": "Simple Tennis Footwork - Eliminate The Unnecessary Steps", "description": "Most tennis players tend to do too many unnecessary steps as are they are positioning for the stroke. Their footwork is too complex and often based on a habit and not on the situation that...", "duration": 494.0, "view_count": null, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "nFJnVN3dhf4", "url": "nFJnVN3dhf4", "title": "Heavy Ball In Tennis And Drills To Master It", "description": "How to hit a heavy ball in tennis and how can you practice it? This video answers both questions by showing you when to hit a heavy ball and when not to attempt it. \n\nIt also includes tennis...", "duration": 1360.0, "view_count": 50075, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "uQTZrPuiURw", "url": "uQTZrPuiURw", "title": "How To Hit The Ball On Time In Tennis", "description": "This video shows a few examples of how you need to initiate the stroke well before you see the ball after the bounce so that you can hit it on time. I explained the main problem in the previous...", "duration": 738.0, "view_count": null, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "fuWAPTzypBg", "url": "fuWAPTzypBg", "title": "#1 Reason Why You're Hitting The Ball Late In Tennis", "description": "This video explains why 90% of all adult recreational tennis players are late on the ball and shows you drills on how to work on this issue. I am quite certain you will not hear this explanation...", "duration": 3609.0, "view_count": null, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "WnpozZV15r8", "url": "WnpozZV15r8", "title": "Tennis Forehand Technique In Slow Motion - Top / Drone View 4K", "description": "If you want to see tennis forehand technique in slow motion from a unique perspective then watch this video recorded from the top / drone view. 🎾 Free Forehand POWER COURSE: https://www.feeltenn...", "duration": 1013.0, "view_count": 37902, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "wWe8UQ7tvSU", "url": "wWe8UQ7tvSU", "title": "Setting Tennis Goals That Motivate You", "description": "Most tennis players set goals with a certain level that they want to reach and along the way they get frustrated and lose confidence every time they don't reach the goal. I propose a different...", "duration": 2140.0, "view_count": null, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "5wS36C9VapY", "url": "5wS36C9VapY", "title": "What Is A Heavy Ball In Tennis - 3 Experiments That Explain It", "description": "So you want to know what is a heavy ball in tennis? A heavy topspin ball has three main elements: topspin, speed and good height above the net which results in good depth.\n\nhttps://www.feeltennis.n...", "duration": 620.0, "view_count": 80978, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "UEVH46_mea4", "url": "UEVH46_mea4", "title": "Tennis Forehand Topspin Drills - Teaching Topspin Implicitly", "description": "The following tennis forehand topspin drills are all implicit which means that they develop topspin through constraints and adaptation. The other way of working on tennis stroke technique is...", "duration": 668.0, "view_count": null, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "FRTW55Py_dY", "url": "FRTW55Py_dY", "title": "The Simplest Tennis Baseline Strategy For Making Smart Decisions", "description": "If you need a simple tennis baseline strategy where you will not over-think and fall into paralysis by analysis, I have one for you. In fact, I would estimate that 80% of tennis decisions in...", "duration": 1397.0, "view_count": null, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "n3Csx1NZTh8", "url": "n3Csx1NZTh8", "title": "Playing Tennis Matches - 5 Tips On Dealing With Pressure", "description": "Dealing with pressure in tennis matches is a big challenge even at recreational level where you're not playing for points or money or your career. In this video I share 5 ways of approaching...", "duration": 1463.0, "view_count": null, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "jSV2ncxcwnQ", "url": "jSV2ncxcwnQ", "title": "How To Prepare Early In Tennis (With Drills)", "description": "Learning how to prepare early in tennis is the key to playing calm and effortless tennis and yet it is very tricky to do. In this video I explain what is the cause for preparing late and show...", "duration": 1816.0, "view_count": null, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "1TvTXZVIVUE", "url": "1TvTXZVIVUE", "title": "Tennis Serve Practice Drills For Improving Basic Technique", "description": "This collection of tennis serve practice drills focuses on building the technical foundation of the serve. Follow along as my student performs key serve drills for better swinging and throwing...", "duration": 1046.0, "view_count": null, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "FCU7USCL6XU", "url": "FCU7USCL6XU", "title": "Best vs Worst Approach Shots In Tennis", "description": "This compilation of best and worst approaches in tennis shows you 4 examples of approaching the net and volleying where aim at the right target using the right amount of power versus going...", "duration": 377.0, "view_count": null, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "ek36icnudmY", "url": "ek36icnudmY", "title": "Tennis Slice Serve Drills - How To Hit Bigger Slice Serves", "description": "The following tennis slice serve drills will help you develop more slice / sidespin, hit at a better angle and get more power on your slice serves. https://www.feeltennis.net/slice-serve-drills/...", "duration": 970.0, "view_count": 75933, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "NXv_d0HL_4I", "url": "NXv_d0HL_4I", "title": "Tennis Serve Leg Drive - Drills And Visual Tips For More Drive", "description": "Tennis serve leg drive drills are the key to developing more power on the serve as the legs drive energy up through the body into the racket. This video shows you how I help the player feel...", "duration": 974.0, "view_count": null, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "NJvL5WtleNA", "url": "NJvL5WtleNA", "title": "Keys To A Good Tennis Forehand - Shoulder Rotation Power", "description": "One of the keys to a good tennis forehand is the shoulder rotation that helps us drive the racket face through the ball. This video shows you various drills I used with my student to help him...", "duration": 1006.0, "view_count": null, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "rn-IjL5N6mE", "url": "rn-IjL5N6mE", "title": "Underestimating Tennis Players Based On The Warm Up Technique", "description": "Every tennis player falls into a trap of underestimating their opponent based on how their technique looks like during the warm up. My goal with this video is that you will never do it again....", "duration": 1024.0, "view_count": null, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "lajZjLVsQcM", "url": "lajZjLVsQcM", "title": "5 Tennis Smash Tips For Handling Difficult Lobs", "description": "The following tennis smash tips show you how to handle difficult lobs that include very high balls, very low balls, very deep balls and so on. Learn the smash / overhead strategies for every...", "duration": 1311.0, "view_count": null, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "69Udt9rySZU", "url": "69Udt9rySZU", "title": "Tennis FOREHAND Challenges - Positioning And Stances (Video Analysis)", "description": "In this analysis we're looking at Alejandro's tennis forehand stroke and comparing it to mine. You'll see the differences in positioning and recovery as well as other technical details like...", "duration": 1232.0, "view_count": null, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "7iuSdv5yeEE", "url": "7iuSdv5yeEE", "title": "When to Approach The Net In Tennis For 80% Success Rate", "description": "Do you know when to approach the net in tennis so that you'll have an 80% success rate? 🎾 Unlock Your Volleys COURSE: https://www.feeltennis.net/volley-course/ \n\nTwo conditions need to be...", "duration": 331.0, "view_count": 43547, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "eYfWxRb1QWU", "url": "eYfWxRb1QWU", "title": "Tennis Kick Serve To Ad vs Deuce Side & Why You Struggle With Deuce", "description": "Tennis players tend to struggle with kick serves to deuce side but not so much with serving to the ad side of the court. This video shows you the difference between racket swing paths and ball...", "duration": 392.0, "view_count": null, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "CQ-Bbj_Hpnc", "url": "CQ-Bbj_Hpnc", "title": "How To Kick A Tennis Serve To Deuce Side Down The T #tennisserve #kickserve", "description": "\"How to kick serve to the deuce side\" - is what tennis players ask when they struggle kicking a tennis serve down the T on the deuce court. 🎾 Free Topspin Serve CONSISTENCY COURSE: https://www.f...", "duration": 1010.0, "view_count": 36823, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "a8PcF4gtVOA", "url": "a8PcF4gtVOA", "title": "Tennis Slice Serve Drills - How To Get More Slice & Angle", "description": "The following tennis serve slice drills are taken from two sessions with my student Allen and show you two different progressions on how to develop more slice and hit the ball at a better angle....", "duration": 942.0, "view_count": null, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "BxDjH888MmY", "url": "BxDjH888MmY", "title": "Tennis Forehand Backswing Tip - Ideal Forehand Loop Size", "description": "What's the optimal tennis forehand backswing size? In other words, how much should you loop your forehand preparation? Tennis players often times don't loop enough their forehand because they...", "duration": 710.0, "view_count": null, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "Av4Rx7YJHzA", "url": "Av4Rx7YJHzA", "title": "Tennis FOREHAND Wrist Position - Closed Or Not?", "description": "What's the best tennis forehand wrist position - palm down with closed racket face or more open? In this video I compare two forehands with different wrist positions and explain pros and cons...", "duration": 1242.0, "view_count": null, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "c4Y48aXa5ko", "url": "c4Y48aXa5ko", "title": "How To APPROACH THE NET In Tennis & More Tactical Tips", "description": "Learn how to approach the net in tennis based on the analysis of several points where I approached the net and won most of the points. I answer questions from members on how to attack in general,...", "duration": 2687.0, "view_count": null, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "NfL-eskFas4", "url": "NfL-eskFas4", "title": "Assess My Tennis Tactics As I Play 15 POINTS And Ask Me Questions!", "description": "This is not an extensive video on tennis tactics but you may still have some questions on how I made my shots. I played 15 points with my friend Peter so that you can watch them and ask me...", "duration": 246.0, "view_count": null, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "ZLIOmJVKhpw", "url": "ZLIOmJVKhpw", "title": "Tennis Consistency Drills For Directions - And Why They Are So Important", "description": "Tennis consistency drills are fundamental to tennis training, particularly in relation to changes of direction. It is important to learn the four key directional drills for forehands, backhands...", "duration": 1364.0, "view_count": null, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "Q_VZUfMkI2U", "url": "Q_VZUfMkI2U", "title": "Tennis Serve Deceleration - How To See It And Practice It", "description": "Deceleration in a tennis serve is very counterintuitive because we think that if we want more powerful serves we need to engage our body as much as possible into the ball. In this video I demonstra...", "duration": 572.0, "view_count": null, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "uxFviqqm5z0", "url": "uxFviqqm5z0", "title": "Tennis Strokes Based On Feel Instead Of Exact Technique", "description": "Learn why you shouldn't obsess over small tennis technique details but rather focus on feel. 🎾 Free Forehand POWER COURSE: https://www.feeltennis.net/forehand-power-course/\n\nTennis players...", "duration": 757.0, "view_count": 28399, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "yAqA70zyaSg", "url": "yAqA70zyaSg", "title": "How I Teach Hitting High Balls - 3 Key Concepts", "description": "Watch Allen learn how to hit a high forehand ball in about 8 minutes. You'll see the 3 key concepts of how to deal with high balls and my teaching progressions to help the player visualize...", "duration": 622.0, "view_count": null, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "iaNHD-M3SOw", "url": "iaNHD-M3SOw", "title": "FOREHAND Wrist Lag - Why You Need Time To Get Into A Good Lag", "description": "If you happen to struggle with not having enough wrist lag on your forehand (or backhand), then don't just try to fix the lag with technical / mechanical corrections. The most likely cause...", "duration": 860.0, "view_count": null, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "LY_oJoyEKu8", "url": "LY_oJoyEKu8", "title": "Non-Dominant Eye In Tennis And How To Minimise Its Effects", "description": "The non-dominant eye negatively affects your vision in tennis and causes you to mistime the ball often and hit it late. Download the 15 Ball Watching Tennis Drills PDF here: https://www.feeltennis....", "duration": 916.0, "view_count": 23232, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "qa5StxzlZaI", "url": "qa5StxzlZaI", "title": "Backhand VOLLEY - The Secret To Short Punch Power", "description": "The way you can get good power on the backhand volley without a backswing is to \"crank the wrist\" - that's how I like to call it. Watch me explain this concept to Allen and see how he is able...", "duration": 976.0, "view_count": null, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "avH3G8ToI1c", "url": "avH3G8ToI1c", "title": "How To Improve Your Tennis Aiming Skills (With Drills)", "description": "One of the common reasons for inconsistent strokes is that the player is not aiming the right way. Coaches and players tend to focus only on technique to address that problem but it often originate...", "duration": 893.0, "view_count": null, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "_Y3CnGA1UTM", "url": "_Y3CnGA1UTM", "title": "TACTICS - Defending VS Neutralizing From Defensive Situations", "description": "When players end up in a defensive situation they logically assume that they need to hit \"defensive\" shots but as you will see in this video this does not work in the long term. It's much better...", "duration": 373.0, "view_count": null, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "tNZJNHYYMDA", "url": "tNZJNHYYMDA", "title": "FOREHAND OPEN STANCE - 2 Common Mistakes And How To Correct Them", "description": "Moving to the side with two steps and hitting an open stance forehand is one of the most common footwork patterns and yet players tend to make two mistakes.They happen in the first and the...", "duration": 597.0, "view_count": null, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "kBDKMAHrzNo", "url": "kBDKMAHrzNo", "title": "How To Get More Topspin In Tennis - 7 Topspin Killers That Hold You Back", "description": "If you want to get more topspin in tennis and you struggle hitting forehands and backhands too flat then check if any of the following 7 mental blocks could be holding you back. \n\nLearning...", "duration": 1150.0, "view_count": 173722, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "eHkeK9I6sfI", "url": "eHkeK9I6sfI", "title": "TACTICS - Watch The Ball Or Watch Opponent Dilemma", "description": "Tennis players may not be sure whether it's better to really watch the ball completely or whether it's better to also look at opponent to see where they are moving and not watch the ball so...", "duration": 993.0, "view_count": null, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "c2YxldD9ulk", "url": "c2YxldD9ulk", "title": "MENTAL Training - How To Deal With A Stiff Arm In Matches", "description": "You may not realise this but every tennis player has experienced a stiff arm and ball going nowhere out of their racket. This is not something that only haunts you, it's something every tennis...", "duration": 2265.0, "view_count": null, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "GltWqIKxkt0", "url": "GltWqIKxkt0", "title": "Watching The Ball In Tennis - 15 Drills For Better Ball Tracking", "description": "Download the 15 Ball Watching Tennis Drills PDF here: https://www.feeltennis.net/15-ball-tracking-drills/\n\nWatching the ball well in tennis is one of the most important skills you need to master...", "duration": 2092.0, "view_count": 79858, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "CKwrlpAFxh0", "url": "CKwrlpAFxh0", "title": "TENNIS IS DIFFICULT - How To Experience The Real Challenge Of Tennis", "description": "Controlling the ball in the game of tennis is very challenging but players usually don't really appreciate how extremely difficult tennis is. In order to demonstrate to them the difficulty...", "duration": 544.0, "view_count": null, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "3cng6UK17gM", "url": "3cng6UK17gM", "title": "TACTICS - Why You Need To Defend Cross Court (for worst case scenario)", "description": "You probably know that it's better to defend cross court than down the line but this is especially important if you happen to defend poorly and hit a short ball. Then the difference between...", "duration": 1035.0, "view_count": null, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "w4OSlfIobss", "url": "w4OSlfIobss", "title": "TENNIS TACTICS - Are We Waiting For Opportunity And Do We Take Risks On Short Balls?", "description": "In today's video we're tackling part 2 of the question from one member. His view is that we play by \"WAITING for an opportunity to take some RISK during the play point.\" So in this video I...", "duration": 1147.0, "view_count": null, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "jCn4LkMo0co", "url": "jCn4LkMo0co", "title": "SMART TACTICS - Are There Any Clever Tactics For Veterans?", "description": "This is part 1 of the answer to one of the members who was asking me if there are any smart tactics at veteran (50+) level... I will post his main question below, but in short, most of tennis...", "duration": 1218.0, "view_count": null, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "3yD2DEL6HkY", "url": "3yD2DEL6HkY", "title": "Best Tennis Movement Tips - For Better Balance And Weight Transfer", "description": "These fundamental tennis movement tips are especially important for adult recreational tennis players since they simplify the complex footwork into just a few easy to follow tips. https://www.feelt...", "duration": 777.0, "view_count": 37019, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "i51fH5AkkYs", "url": "i51fH5AkkYs", "title": "SINGLES TACTICS - Where To Aim When Behind The Baseline", "description": "I have pointed out targets for singles before but it's worth showing the same idea with a different video because this is the most fundamental tactical principle for singles tactics. You will...", "duration": 763.0, "view_count": null, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "xLCqJkS3A_4", "url": "xLCqJkS3A_4", "title": "FOREHAND & NO TOPSPIN - Why Hitting Late Robs You Of Topspin", "description": "One of the biggest problems in tennis is hitting the ball late, especially on forehands, which causes problems with ball control and power. But hitting late also prevents you from hitting the...", "duration": 601.0, "view_count": null, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "Gc7vNXOnqjI", "url": "Gc7vNXOnqjI", "title": "FOREHAND Skeleton View - How I See The Forehand Technique Now", "description": "In this video I explain how to look at the forehand technique in a more wholistic view by using the skeleton view that video analysis apps now provide. The two best video analysis apps on the...", "duration": 295.0, "view_count": null, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "1daoOHnIgOI", "url": "1daoOHnIgOI", "title": "FOREHAND VOLLEY Lesson - Building the Foundation For Ball Control", "description": "The foundation of a good volley is the ability to control direction of the ball really well and to be able to impart backspin on the ball so that the ball floats in a controlled manner towards...", "duration": 619.0, "view_count": null, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "NwbxznLExyQ", "url": "NwbxznLExyQ", "title": "How To Calm Down In Tennis", "description": "The game of tennis is very chaotic at beginner and intermediate levels which means there no real order or pattern to it. https://www.feeltennis.net/calm-down/\n\nThe incoming balls from your...", "duration": 824.0, "view_count": 66996, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "AhVYEpeeQHs", "url": "AhVYEpeeQHs", "title": "Forehand and Backhand VOLLEY - Analysis From Topview (Drone)", "description": "The last 2 strokes to look at from the drone / top view are the forehand and backhand volleys. The video includes volleys shown in super slow motion as well as a side-by-side comparison down...", "duration": 484.0, "view_count": null, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "CLEjGDGEGaA", "url": "CLEjGDGEGaA", "title": "Volley & Smash Course Launch", "description": "The Volley & Smash course is finally available! To get a better sense of the level of instruction covered in the course, you can check out the 4 free course videos listed below. You will also...", "duration": 274.0, "view_count": null, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "MZ9v7kqIIXk", "url": "MZ9v7kqIIXk", "title": "SERVE TOSS - Top / Drone View Of The Flat, Slice and Topspin Tosses", "description": "How do tosses for different serve types like flat, topspin and slice serve look like from the top view? This video shows you all the tosses in slow motion as well as comparisons between all...", "duration": 466.0, "view_count": null, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "xrwjUM1WvhY", "url": "xrwjUM1WvhY", "title": "1H BACKHAND & SLICE TOP VIEW - Drone View Analysis Of The Backhands", "description": "This is the second video using the top view analysis from a drone and in this video we're looking at the backhand topspin and backhand slice. You'll also see how this top view helps with a...", "duration": 370.0, "view_count": null, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "sKOrSuPTLMQ", "url": "sKOrSuPTLMQ", "title": "What Is A Good Neutralising Ball In Tennis?", "description": "When you hit.a good neutral ball in tennis you keep your opponent behind the baseline and prevent them from attacking you. https://www.feeltennis.net/neutralising-ball/\n\nNot only that, a good...", "duration": 685.0, "view_count": 15438, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "nUv3YZfSpVk", "url": "nUv3YZfSpVk", "title": "FOREHAND TOP VIEW - Analysis Of The Forehand From Drone View", "description": "I have recently invested into a drone, the model name is DJI Mini Pro 3, because I thought it would be really interesting to to video analysis of tennis strokes from the top view. In this video...", "duration": 443.0, "view_count": null, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "FgbJn6t7Rpg", "url": "FgbJn6t7Rpg", "title": "Tennis TACTICS - Why Placement Is Better Than Power", "description": "You've surely heard the idea the placement is more important than power but you probably haven't heard the right explanation why. In this video I explain to my student why I prefer to aim for...", "duration": 440.0, "view_count": null, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "6vgsYelPy2Y", "url": "6vgsYelPy2Y", "title": "Ideal Tennis Grip Pressure For Each Stroke", "description": "Ever wondered what’s the right amount of grip pressure for all tennis strokes? https://www.feeltennis.net/grip-pressure/\n\nThe usual advice of coaches is to hold the racket more loose but...", "duration": 1330.0, "view_count": 23349, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "73FRyz5dXFQ", "url": "73FRyz5dXFQ", "title": "Tennis STRATEGY - The Aggressive - Safe Concept Explained", "description": "Most of your baseline tennis should be played with aggressive - safe mindset. In this video I explain this approach and I also mention 2 risks you have to deal with. They are explained in more...", "duration": 421.0, "view_count": null, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "F2WfsG2pRD8", "url": "F2WfsG2pRD8", "title": "SERVE Backswing Tips And \"Fighting\" the Waiter's Tray", "description": "The dreaded waiter's tray (open racket face) in the serve trophy position prevents you from serving with good power and control. You can \"fight\" the waiter's tray by following the 3 main tips...", "duration": 883.0, "view_count": null, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "tQ-NGkU1ntk", "url": "tQ-NGkU1ntk", "title": "How To Hit Tennis Serves With Maximum Power", "description": "If you want to hit a tennis serve with your maximum power you need to make sure your mind is not holding you back. 🎾 Free Second Serve CONSISTENCY COURSE: https://www.feeltennis.net/second-serve...", "duration": 751.0, "view_count": 26881, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "rrtL5QtPflE", "url": "rrtL5QtPflE", "title": "FOREHAND Inside Out - Why I Use It For Technique Correction", "description": "Even at very early stages of forehand technique corrections I use inside out forehand drill all the time and in this video I explain why. I also recommend you check the topics linked below...", "duration": 320.0, "view_count": null, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "nzVA7JUOBiQ", "url": "nzVA7JUOBiQ", "title": "Tennis TACTICS & MENTAL - Don't Show All Your Cards", "description": "When you start the match you must not make too many mistakes - not in the warm up and not in the first few games of the match. If you do, your opponent will have a very clear game plan immediately...", "duration": 257.0, "view_count": null, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "ZMkiPrlJGKY", "url": "ZMkiPrlJGKY", "title": "Why Is The Inside Out / In Forehand In Tennis So Effective?", "description": "One of the tennis strategies that the pros use to maximise their forehand power is to run around their backhand and play inside out and inside in forehands. 🎾 Free Forehand POWER COURSE:...", "duration": 994.0, "view_count": 20057, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "Bm8rqmDoNM0", "url": "Bm8rqmDoNM0", "title": "Backhand SLICE - Two Tips For Better Power And Ball Control", "description": "The usual challenges of the backhand slice are over-rotation but also incorrect weight transfer which is quite counter-intuitive. In this lesson with Vladimira you'll see a mechanics correction...", "duration": 916.0, "view_count": null, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "EJEWsypByQg", "url": "EJEWsypByQg", "title": "FOREHAND Preparation - The Work Of The Non-Dominant Arm", "description": "If you prepare the forehand the right way, then all of the work has to be done with the non-dominant arm in order to relax the hitting arm. If the hitting arm is preparing the forehand too,...", "duration": 726.0, "view_count": null, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "sJTkThAKMMQ", "url": "sJTkThAKMMQ", "title": "How To Aim In Tennis For Better Ball Control", "description": "One of the most common reasons for poor consistency of your tennis strokes is something you may not have considered at all. It’s how you AIM your shots.\n\nhttps://www.feeltennis.net/how-to-aim/...", "duration": 1527.0, "view_count": 55657, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "Yebo7dNGVMc", "url": "Yebo7dNGVMc", "title": "Tennis TIPS - How To Easily Hit Sharp Cross Court Shots", "description": "If you struggle with hitting sharp cross court shots then you may not be positioning correctly to the ball. The key to cross court shots is not in your hands but in your feet...", "duration": 769.0, "view_count": null, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "zLimbhEWF8k", "url": "zLimbhEWF8k", "title": "Flat SERVE Problem - When You Often Hit SLICE Instead Of FLAT", "description": "What do to if when you attempt a flat serve you often hit a slice? Should you change your feet position, toss or anything else? In this video I explain what steps you should take to really...", "duration": 301.0, "view_count": null, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "uvQnInSTL0s", "url": "uvQnInSTL0s", "title": "MENTAL Tennis - The Match Does Not Confirm You're Winning", "description": "When you play a match you're of course anxious to know if you're on the right track to winning it. But the match score will not give you confirmation that you're on the right track so if you...", "duration": 411.0, "view_count": null, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "AOUlZtqt_aA", "url": "AOUlZtqt_aA", "title": "SERVE Over-Rotation Problem And Drills To Correct It", "description": "Over-rotation on the serve is a very common mistake because it seems logical and intuitive to the player to orient towards the court as they are hitting the ball. But we lose on power and control...", "duration": 487.0, "view_count": null, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "znItkwu6Szk", "url": "znItkwu6Szk", "title": "Tennis Warm Up Coordination & Movement Drills - Part 2", "description": "It's time for the part 2 of the \"Tennis Warm Up Coordination & Movement Drills\" where I'll show you 7 different variations you can use to keep the drills interesting and effective.\n\nIf you've...", "duration": 915.0, "view_count": 7375, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "-MDjsQ8xWfs", "url": "-MDjsQ8xWfs", "title": "LOB TIPS - The Right Mindset And How To Practice In A Game", "description": "While a lob is mostly a feel based stroke and we cannot go very deep into technique, it's important to have the right mindset otherwise long term you'll be hitting way too short too often....", "duration": 553.0, "view_count": null, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "B7ZqW6wnKSI", "url": "B7ZqW6wnKSI", "title": "Tennis Warm Up Drills - Improving Coordination & Footwork", "description": "One way of making your tennis warm up more effective is to use drills that work on the coordination of upper and lower body. Coordination is another word for efficient organisation of different...", "duration": 1130.0, "view_count": 22759, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "k6FR98eowVk", "url": "k6FR98eowVk", "title": "BACKHAND SLICE Weight Transfer Tip", "description": "Spencer is hitting a really solid backhand slice but struggles a bit with consistency and depth. I could not really see the problem until I compared our shots in video analysis. Check out my...", "duration": 481.0, "view_count": null, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "Hl_XpTdfAqI", "url": "Hl_XpTdfAqI", "title": "Tennis DOUBLES Tip - Where to Aim Your Returns", "description": "When you play doubles it's important not be distracted by the net player who is looking to poach and intercept your return. But you will only have a peace of mind on the return if you know...", "duration": 351.0, "view_count": null, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "UVK6k-mYDV0", "url": "UVK6k-mYDV0", "title": "Tennis TACTICS - The Importance Of A Neutralising Ball", "description": "When you're playing a match your opponent will make you run and put you under pressure here and there. Where tennis players go wrong is that they want to get out of this pressure situation...", "duration": 510.0, "view_count": null, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "8sc_2usSCDI", "url": "8sc_2usSCDI", "title": "TENNIS TECHNIQUE - How Your Brain Works Against You", "description": "When you are learning and also just playing tennis, your brain is by default working against you without you realising what's the problem. In this video I explain how the brain works against...", "duration": 648.0, "view_count": null, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "dCAdmYZexko", "url": "dCAdmYZexko", "title": "How To Disguise Your Tennis Serve", "description": "Our serves are not as fast as on the pro tour so we need to find different ways of getting an edge over the opponent’s return. One way is to make serves unpredictable and the other is to...", "duration": 755.0, "view_count": 4777, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "1ZkPVd-3iLo", "url": "1ZkPVd-3iLo", "title": "MENTAL Tennis - Overcoming Being Cautious", "description": "Being cautious in tennis is never going to work, here's my explanation what happens, how your body reacts and why your shots don't go anywhere and what to do about it. I recently also shared...", "duration": 575.0, "view_count": null, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "-iCns_5RoQU", "url": "-iCns_5RoQU", "title": "TOPSPIN SERVE - Case Study With Drills", "description": "In this case study you'll see my student's progress in developing a topspin serve in just 5 days and you'll see the key drills we used to help the player progress so fast. If you want to check...", "duration": 897.0, "view_count": null, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "3FmuKrY_sZM", "url": "3FmuKrY_sZM", "title": "Tennis Serve Myth - All Types Of Serves From The Same Toss?", "description": "One of the myths related to a tennis serve often comes up in my tennis lessons and online discussions and the myth says: \"A good server can hit ANY TYPE of the serve from the same toss.\"\n\nANY...", "duration": 584.0, "view_count": 8943, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "4ypl_F1Q5nA", "url": "4ypl_F1Q5nA", "title": "FOREHAND OPEN STANCE - How To Work On Open Stance And Balance On Mini Tennis", "description": "The forehand open stance is more tricky than it seems. Most recreational tennis players perform it incorrectly as they are not clear on different ways we can transfer weight (or not) and how...", "duration": 1159.0, "view_count": null, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "WmeMnajrAi8", "url": "WmeMnajrAi8", "title": "Tennis TIPS / TACTICS - 4 main reasons for missing a shot", "description": "Tennis players tend to immediately blame their stroke technique for missing a shot because they used the \"stroke\" to hit the ball and they missed. But we need to evaluate more carefully what...", "duration": 435.0, "view_count": null, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "ETcR1343d-Q", "url": "ETcR1343d-Q", "title": "How To Read A Tennis Serve And Return It Consistently", "description": "How can you read a tennis serve well and anticipate the type and direction so that you return it well? 🎾 Free Second Serve CONSISTENCY COURSE: https://www.feeltennis.net/second-serve-tips/...", "duration": 719.0, "view_count": 12911, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "YuP1z9_MmeY", "url": "YuP1z9_MmeY", "title": "FOREHAND Shoulder Rotation - The Most Effective Drill That I Know", "description": "The most effective way to teach a tennis player a new movement is to have them feel it. And in this video I show how to help my student feel shoulder rotation on the forehand. Of all the drills...", "duration": 402.0, "view_count": null, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "bLL75BkjL0g", "url": "bLL75BkjL0g", "title": "MENTAL Tennis - How To Warm Up In The Match To Calm Your Nerves", "description": "This video explains how to warm up from the baseline in those 5-10 minutes before the match starts so that you calm down your nerves and release the tension you may feel. You'll also learn...", "duration": 432.0, "view_count": null, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "D_5w-x6SyQc", "url": "D_5w-x6SyQc", "title": "Improve Your Tennis Game By Holding Your Ground On The Baseline", "description": "In order to improve your game is tennis the fastest way you need to practice very efficiently. The main skillset that separates lower and higher level players is their ability to adapt to different...", "duration": 1331.0, "view_count": 12220, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "pfekV0ia0VQ", "url": "pfekV0ia0VQ", "title": "Tennis TIPS - How To Hide Your Intention On Groundstrokes", "description": "Players often ask me if there is a way to hide the intention of your strokes since they realize their opponent is \"reading\" them pretty well. Yes, there is a way but we use it rarely since...", "duration": 480.0, "view_count": null, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "HW7qUN0Si3o", "url": "HW7qUN0Si3o", "title": "Backhand SLICE - Dispelling The Common Myth", "description": "The best way to explain how the backhand slice \"works\" is if you have a ball attached on a stick like in this example. Then the student can see how it's possible to spin the ball in the same...", "duration": 247.0, "view_count": null, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "esbtmHTBGzw", "url": "esbtmHTBGzw", "title": "Tennis TACTICS - How To Train Early And Correct Decisions", "description": "The problem with training decisions of your player(s) if you're a coach is that you can't see in their mind so you don't know WHEN or WHAT decision they made. But if you ask them to call out...", "duration": 657.0, "view_count": null, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "FLmwlQzjiQA", "url": "FLmwlQzjiQA", "title": "Tennis FOOTWORK - Split Step Timing Explained", "description": "When it comes to the split step one question always comes up: when exactly do I need to split step? In this video I'll show you that we cannot say exactly when to split step, we can only say...", "duration": 695.0, "view_count": null, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "3VpIPk-xazM", "url": "3VpIPk-xazM", "title": "Tennis Technique Corrections With Wearbands - Review Of Wearbands Training Aid", "description": "My Wearbands review focuses on tennis technique corrections which is how I have been using Wearbands for many years now. Link to their website: https://wearbands.com/\n\nWhile Wearbands is primarily...", "duration": 1640.0, "view_count": 9123, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "iT5XBcKjd8g", "url": "iT5XBcKjd8g", "title": "Tennis VOLLEY & MENTAL - Drill For Precision And There Are No Mistakes", "description": "In this volley drill video I would like you to notice two key ideas: how I hold my hand out in order to give the player a target area even though we focus on technique AND my explanation about...", "duration": 314.0, "view_count": null, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "AwkdTCWSVh4", "url": "AwkdTCWSVh4", "title": "Tennis TIPS - Waiting For The Ball And Hitting At Low Contact", "description": "This video includes some extra footage that was not included in the public video on \"How To Wait For The Ball\". The most interesting part will likely be the side by side comparison of side...", "duration": 293.0, "view_count": null, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "odaovYa8we8", "url": "odaovYa8we8", "title": "Improve Your Tennis Timing Skills By Waiting For The Ball", "description": "Every skilled tennis player knows how to wait for the ball to reach them if they choose to do so. 🎾 Free Forehand POWER COURSE: https://www.feeltennis.net/forehand-power-course/\n\nToday's...", "duration": 1204.0, "view_count": 63114, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "iLmjzVPpl8c", "url": "iLmjzVPpl8c", "title": "Tennis RETURN - How To Drill The Return Footwork Pattern", "description": "The return footwork pattern is different from the usual footwork pattern when we're hitting a groundstroke and that can be a problem if you're not aware if it. In this video you'll see Andre...", "duration": 554.0, "view_count": null, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "i_kdlTn72Rg", "url": "i_kdlTn72Rg", "title": "Tennis TIPS - Game Based VS Technical Method Of Teaching Explained", "description": "I wanted to share the Game Based approach with you all so that you are aware of it as you won't see almost any examples of it on Youtube. Here's one coach on Instagram that does understand...", "duration": 1215.0, "view_count": null, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "jm749eF7hjA", "url": "jm749eF7hjA", "title": "How To Make Quick Decisions In Tennis", "description": "In order to play tennis well in matches, we need to make very quick decisions because even at recreational level the ball flight time from the opponent to us is less than 2 seconds.\n\nOne way...", "duration": 365.0, "view_count": 10315, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "-sS1-A4H8jE", "url": "-sS1-A4H8jE", "title": "Serve RETURN - Why You Don't Need To Hit A \"Good Shot / Return\"", "description": "In this return of second serve session with Christian we'll go first through an assessment of this return skills and then we'll figure out what exactly is his issue. Wanting to hit \"a good...", "duration": 966.0, "view_count": null, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "gyR8KUo_SB8", "url": "gyR8KUo_SB8", "title": "Serve RETURN - Making The Right Type Of Split Step", "description": "In this session with Christian we check his return of serve on first serves using video analysis and we discover that his split step is not performed right. You'll see me demonstrate the correct...", "duration": 409.0, "view_count": null, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "tgxFZJnhKmo", "url": "tgxFZJnhKmo", "title": "Ideal Tennis Recovery Position And How To Get There On Time", "description": "Getting to the ideal tennis recovery position is the key to getting to difficult balls as we always start with the shortest distance to them. But to reach the ideal recovery position you need...", "duration": 624.0, "view_count": 9278, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "LNBcn_eShl8", "url": "LNBcn_eShl8", "title": "Tennis TACTICS - How To Manage RISK In The Match", "description": "There are two types of risk in the match, the risk of missing the shot (which everyone is aware of) and risk of losing the point (which is not as obvious). Most tennis players \"see\" only the...", "duration": 466.0, "view_count": null, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "MNrqDBIh3Ng", "url": "MNrqDBIh3Ng", "title": "Tennis Quick Movement To The Ball (Just In Case It's FAST!)", "description": "You can move quicker to the ball in tennis maximizing your footwork ability if you apply the \"just in case\" concept! 🎾 Free Forehand POWER COURSE: https://www.feeltennis.net/forehand-power-cours...", "duration": 617.0, "view_count": 9824, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "r3SuPavw3KE", "url": "r3SuPavw3KE", "title": "Tennis TACTICS - Why We Play More Cross Court Than Down The LIne", "description": "You've all heard the usual reasons for playing more cross court than down the line: the court is longer, the net is lower, etc. But that's not the main reason why we play cross court...", "duration": 187.0, "view_count": null, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "vSEUMEgWvwg", "url": "vSEUMEgWvwg", "title": "Prepare Tennis Strokes Early Just In Case...", "description": "One of the biggest problems in tennis is hitting the ball late therefore the most common tennis tip is to \"prepare early\". 🎾 Free Forehand POWER COURSE: https://www.feeltennis.net/forehand-power...", "duration": 618.0, "view_count": 18386, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "JulbsNPLMzM", "url": "JulbsNPLMzM", "title": "Tennis SERVE - The \"Being Loose\" Misconception", "description": "Tennis players tend to take the advice of \"being loose\" on the serve too literally and they stay loose throughout the whole service action. That's not going to produce any significant power...", "duration": 281.0, "view_count": null, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "s2QRkmttd2w", "url": "s2QRkmttd2w", "title": "The Split Step In Tennis And Why You Do It \"Just In Case\"", "description": "Most tennis players don't split step well and therefore hurt their footwork and speed of movement to the ball. One reason for that is because we mostly split step just in case  - and that's...", "duration": 373.0, "view_count": 14703, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "bhFrf_xA77o", "url": "bhFrf_xA77o", "title": "Tennis Slice Serve Analyzed In Slow Motion", "description": "The above tennis slice serve technique was analyzed in slow motion thanks to 240 frames per second camera capture of the Ipad Pro. https://www.feeltennis.net/slice-serve-technique/\n\nYou'll...", "duration": 1081.0, "view_count": 104636, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "nYs63671_1M", "url": "nYs63671_1M", "title": "Tennis VOLLEY - Work On Technique Already At Mini Tennis", "description": "You can work on your volley technique already when you're warming up on mini tennis by paying attention to very simple guidelines. They are just basic positions on where to prepare the volley...", "duration": 529.0, "view_count": null, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "mmAdLfZbEcc", "url": "mmAdLfZbEcc", "title": "Tennis TIPS - Different Contact Point For Different Direction Of Stroke", "description": "When we're hitting groundstrokes (and volleys) we ideally want to position differently in relation to the ball depending on whether we're hitting down the line or cross court. In this video...", "duration": 356.0, "view_count": null, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "0FhYXBGk-oQ", "url": "0FhYXBGk-oQ", "title": "8 Key Shots To Practice On Your Tennis Groundstrokes", "description": "What are the most common forehands and backhands in a tennis match that you need to master? \n\nWhile there are obviously many different situations in tennis that require us to adjust our strokes...", "duration": 653.0, "view_count": 21605, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "G2Hilix6umI", "url": "G2Hilix6umI", "title": "MENTAL Tennis - How To Heal Your Trauma Of Missing Shots", "description": "Most tennis players are slightly traumatized in certain situations in a match and I intentionally use the word trauma here in order to make you pay attention. Whenever you feel anxiety coming...", "duration": 441.0, "view_count": null, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "pI8BloI4AQE", "url": "pI8BloI4AQE", "title": "Tennis Serve Wrist Snap Myth Dispelled", "description": "One of the biggest myths in tennis is the illusion of a wrist snap on a serve. In today's video article I'll show you a tennis serve from 4 different angles recorded in super slow motion and...", "duration": 692.0, "view_count": 24319, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "n2WKpJomOIA", "url": "n2WKpJomOIA", "title": "Tennis TACTICS - How Math Helps You Improve Your Consistency", "description": "Tennis players feel that the longer the rally goes on the higher the probability of missing. And so they can't sustain this pressure and usually hit a risky shot to get out of this pressure....", "duration": 431.0, "view_count": null, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "-X_hAHP_N-w", "url": "-X_hAHP_N-w", "title": "The Only Way To Hit A Topspin Tennis Serve", "description": "Struggling with a topspin tennis serve? 🎾 Free Second Serve CONSISTENCY COURSE: https://www.feeltennis.net/second-serve-tips/\n\nI review and analyse many videos of tennis players over a course...", "duration": 617.0, "view_count": 61529, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "PdbKBfDWs8s", "url": "PdbKBfDWs8s", "title": "Tennis TACTICS - Power vs Placement", "description": "The more power you hit with the less precise your shot will be. This is a very important concept to keep in mind when attacking short balls. Most players want to hit short balls with more power...", "duration": 269.0, "view_count": null, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "XOkNj_otYy8", "url": "XOkNj_otYy8", "title": "TOPSPIN SERVE - Swing path explained and comparison with a flat serve", "description": "The swing path and how the body works are quite different when we compare a topspin serve and a flat serve. In the first part of the video I explain just a topspin serve in slow motion and...", "duration": 390.0, "view_count": null, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "ri2NoXCaKBw", "url": "ri2NoXCaKBw", "title": "Tips On How To Deal With Pressure In Tennis", "description": "Every tennis player experiences pressure in matches and even in practice sessions, the only question is how severe is this pressure. \n\nThe main reason for feeling the pressure is focusing on...", "duration": 264.0, "view_count": 9032, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "pD1soKn5Kik", "url": "pD1soKn5Kik", "title": "FOOTWORK & TECHNIQUE - The Challenge Of Coordination", "description": "When tennis players don't use efficient footwork patterns, we need to teach them. As we teach them they stop moving naturally. ;( The second problem is also that their arm & racket stop moving...", "duration": 450.0, "view_count": null, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "eRariH95hoE", "url": "eRariH95hoE", "title": "How To Set Up Early For Tennis Groundstrokes And Overheads", "description": "If you don't set up for a tennis stroke early enough your ball control and technique are going to suffer. 🎾 Free Forehand POWER COURSE: https://www.feeltennis.net/forehand-power-course/...", "duration": 1098.0, "view_count": 85784, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "xb01L1WhOFY", "url": "xb01L1WhOFY", "title": "FOREHAND - 4 Major Biomechanical Components Of The Forehand", "description": "Check the free forehand course where I go more in-depth into each forehand component and also show you simple drills on how to improve them: https://www.feeltennis.net/forehand-power-course/...", "duration": 682.0, "view_count": null, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "atD6qRDx_ck", "url": "atD6qRDx_ck", "title": "FOREHAND Analysis - Weight Transfer Misconception", "description": "My student Yuning has been taking lessons on the forehand and it seems she has been told a lot to step in to the ball. In this forehand video analysis I compare her forehand with mine and explain...", "duration": 848.0, "view_count": null, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "9LhJzhhaPn0", "url": "9LhJzhhaPn0", "title": "Wrist Action On A Topspin Tennis Serve", "description": "Not sure how to use the wrist on a topspin tennis serve? Check the video above but first sign up for a free topspin CONSISTENCY course: https://www.feeltennis.net/second-serve-tips/\n\nTennis...", "duration": 596.0, "view_count": 35011, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "0pnhkXT9g_o", "url": "0pnhkXT9g_o", "title": "Tennis SERVE - How To Start Warming Up The Serve", "description": "In this interesting session with Allen we discuss how to warm up the serve. You'll see me demonstrate how I would warm up the serve if I were to start playing the match next and doing my best...", "duration": 982.0, "view_count": null, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "OWn66X_96V4", "url": "OWn66X_96V4", "title": "Tennis FOREHAND \"Thirds\" Principle - How To Hit A Relaxed Forehand", "description": "You've often times heard the idea of swinging more effortlessly on your forehands or backhands but what does that really mean? Should you be relaxed during the whole stroke execution or just...", "duration": 412.0, "view_count": null, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "u1KaBOZ7Ul0", "url": "u1KaBOZ7Ul0", "title": "Tennis SERVE - Sync The Arms", "description": "If you're currently serving style is that you lag the hitting arm behind the tossing arm, then you may struggle with timing and toss accuracy. If you want to learn how to move the arms more...", "duration": 144.0, "view_count": null, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "evv2WkBOAvE", "url": "evv2WkBOAvE", "title": "Tennis SERVE -  Correcting The Waiter's Tray", "description": "The so called \"waiter's tray\" tennis serve is one of the most common and the most challenging technical flaws to correct. In this video I am showing how just one of the methods I explain in...", "duration": 1175.0, "view_count": null, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "ee1hrgvuMRo", "url": "ee1hrgvuMRo", "title": "TOPSPIN Serve - The Exaggeration Vs Reality", "description": "Tennis coaches use a lot of exaggerations in various exercises when teaching the player new techniques. In case of a topspin serve we ask the player to serve the ball upwards with topspin but...", "duration": 225.0, "view_count": null, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "nq9dalYyHJE", "url": "nq9dalYyHJE", "title": "Tennis Backhand Slice Tips For Handling High Balls", "description": "Today's video is the conclusion of backhand slice tips and the final video is all about handling high balls. 🎾 Free One-Handed Backhand CONSISTENCY COURSE: https://www.feeltennis.net/1h-backhand...", "duration": 445.0, "view_count": 23908, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "TZKXbtklo0k", "url": "TZKXbtklo0k", "title": "MENTAL Tennis - How Not To Feel Doubt When Making A Shot", "description": "The opposite of confidence is doubt and feeling doubt when making the shot causes us to miss it many times. In this video I explain why you need to focus on the execution (process) and not...", "duration": 824.0, "view_count": null, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "mpv3GlpXcYc", "url": "mpv3GlpXcYc", "title": "Backhand Slice Tips For Medium / Waist High Balls", "description": "We're staying on the topic of tennis backhand and forehand slice shots and today we're looking at the medium height contact ball. 🎾 Free One-Handed Backhand CONSISTENCY COURSE: https://www.feelt...", "duration": 519.0, "view_count": 16019, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "eK_RevrXN9w", "url": "eK_RevrXN9w", "title": "TOPSPIN SERVE - The importance of hitting the ball finely", "description": "One important concept in tennis is hitting the ball finely, very precisely even when we hit it harder. This is not obvious to the naked eye as we watch players on ATP and WTA hit with lots...", "duration": 393.0, "view_count": null, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "N0fMox10i0w", "url": "N0fMox10i0w", "title": "Tennis Backhand Slice Tips For Handling Low Balls", "description": "If you're inconsistent with your backhand slice when hitting low balls then these simple tennis tips can help you hit more reliably. 🎾 Free One-Handed Backhand CONSISTENCY COURSE: https://www.fe...", "duration": 337.0, "view_count": 14208, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "qxDuA-K5jPc", "url": "qxDuA-K5jPc", "title": "FOREHAND VOLLEY - Video Analysis and First Drill", "description": "Because the forehand volley is such a tricky shot I'll upload quite a few videos on this topic to hopefully clarify what's the right technique and which drills to use to develop it.", "duration": 446.0, "view_count": null, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "8a1j-3skBxw", "url": "8a1j-3skBxw", "title": "How To Hit A Topspin Tennis Serve At A Lower Contact Point", "description": "Tennis players often struggle with a topspin serve because they are used to hitting the ball at high contact point. 🎾 Free Second Serve CONSISTENCY COURSE: https://www.feeltennis.net/second-serv...", "duration": 169.0, "view_count": 11956, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "prfJZmf91b0", "url": "prfJZmf91b0", "title": "Tennis SMASH - Learning Control First Before Looking For Power", "description": "Tennis players tend to go for too much on overheads because they have this fixed idea that they need to finish the point. But they still lack the control of the smash and therefore they make...", "duration": 372.0, "view_count": null, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "O6bt0bJJ3fk", "url": "O6bt0bJJ3fk", "title": "Tennis VOLLEY  - There are \"no easy volleys\" mindset", "description": "Once you watch the whole video you'll get the point of it so I didn't record any intro today. I explain to Allen how we must not \"define\" any volley (or any other situation) as \"easy\" because...", "duration": 262.0, "view_count": null, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "H-GwM_LYc90", "url": "H-GwM_LYc90", "title": "How Playing Tennis Slowly Improves Your Technique And Timing", "description": "One of the biggest challenges in tennis is hitting the ball late and surprisingly you can correct that by playing tennis slowly. 🎾 Free Forehand POWER COURSE: https://www.feeltennis.net/forehand...", "duration": 874.0, "view_count": 62949, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "XdK72uWjXLk", "url": "XdK72uWjXLk", "title": "Tennis SERVE Pronation - How To Perform The Drill Correctly", "description": "In this short session working on the pronation pay attention to my corrections of the player's execution of the drill and also pay attention to all sorts of tips that I share. There are many...", "duration": 375.0, "view_count": null, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "pc1irvn8Dro", "url": "pc1irvn8Dro", "title": "FOREHAND Open Stance - Short Video Analysis", "description": "This is just a short video I recorded today with my student explaining them the forehand open stance when there is no weight transfer happening during the stroke. So weight transfer is delayed...", "duration": 145.0, "view_count": null, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "_jYKMrrhCN4", "url": "_jYKMrrhCN4", "title": "Tennis FOREHAND - The \"Robot\" Forehand Concept For Better Body Engagement", "description": "When players don't engage their non-dominant arm while hitting a forehand that means they relaxed their non-dominant side. To give them a better idea how a forehand (or a two-handed backhand)...", "duration": 799.0, "view_count": null, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "_yxC1E2P-gY", "url": "_yxC1E2P-gY", "title": "Tennis TACTICS - The process of mastering the short ball attack", "description": "I know everyone would like to get really good really fast but tennis doesn't work that way nor does any demanding skill in life. In this clip I am sharing my journey to mastering the short...", "duration": 342.0, "view_count": null, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "Auem1-8t3rE", "url": "Auem1-8t3rE", "title": "Why Every Tennis Forehand Starts With An Open Stance", "description": "It may sound like an open stance forehand is an advanced version of a tennis forehand but I'd like to show you that the open stance always starts before neutral stance. 🎾 Free Forehand POWER...", "duration": 1093.0, "view_count": 41003, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "Y4q_AF0_kZM", "url": "Y4q_AF0_kZM", "title": "Tennis MENTAL - How To Flip The Pressure From Yourself Onto Your Opponent", "description": "One of the reasons why we feel pressure in matches is because we see that we have to solve many problems that our opponent presents if we want to win a match. So that can be overwhelming and...", "duration": 188.0, "view_count": null, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "ySxy5d4wf0s", "url": "ySxy5d4wf0s", "title": "MENTAL Tennis - Don't rely on your serve mentally", "description": "Wanting to have your serve as a weapon can be a very \"shaky belief\" that will crumble on the first bad day of serving. I explain to the players that I rely on my grit, working hard, making...", "duration": 249.0, "view_count": null, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "P1eOW52e3t4", "url": "P1eOW52e3t4", "title": "Basic Tennis Strategy From The Baseline - How To Decide What To Play", "description": "The basic strategy and decision process when playing tennis from the baseline is relatively simple but it requires good discipline to give you good results. More videos like this in the membership...", "duration": 886.0, "view_count": 18485, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "S1ztwcIaHZg", "url": "S1ztwcIaHZg", "title": "Tennis ONE HANDED BACKHAND - How to control a fast incoming ball", "description": "If you're receiving a faster ball to your one-handed backhand, your main goal is to control it. The way we control such balls in tennis (if we can) is through body mass moving into the ball....", "duration": 310.0, "view_count": null, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "ZO24PRLdHv8", "url": "ZO24PRLdHv8", "title": "Tennis FOREHAND Examples - Neutral vs Open Stance & Timing", "description": "In this video I am analyzing my own forehand using an app called OnForm. I am hitting in neutral and open stances, hitting some balls early and some not, hitting them at different heights and...", "duration": 645.0, "view_count": null, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "cgjYvfHTIc0", "url": "cgjYvfHTIc0", "title": "Learning Tennis Online And The Danger Of Misinterpretation", "description": "Learning tennis online through the power of the internet is a wonderful thing as it allows us coaches to share our knowledge and experience with many more people and of course it helps you...", "duration": 317.0, "view_count": 6348, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "PVgmicFy3GQ", "url": "PVgmicFy3GQ", "title": "Tennis TIPS - Your current stroke skill level VS desired stroke skill level", "description": "One common problem as your work on your tennis game is that you want to play much better than you current level. So you need to take it through all the levels step by step to eventually master...", "duration": 569.0, "view_count": null, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "nkUpjKTzYec", "url": "nkUpjKTzYec", "title": "Playing High Balls In Tennis The Smart Way (Forehand & Backhand)", "description": "One of the most uncomfortable situations in tennis is when you have to hit a high ball, meaning making contact with the ball above your shoulders. 🎾 Free Forehand POWER COURSE: https://www.feelt...", "duration": 619.0, "view_count": 46241, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "4PRbNCe1ZYw", "url": "4PRbNCe1ZYw", "title": "Tennis TACTICS - When to hit down the line", "description": "When it comes to tactical decisions, you need to make them quick. You can only make them quick if the process of deciding in your mind has to run through very simple options. This video gives...", "duration": 197.0, "view_count": null, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "jjQ5Pw76v8s", "url": "jjQ5Pw76v8s", "title": "Guidelines For Hitting Waist High Contact Tennis Forehands And Backhands", "description": "Hitting a forehand or a backhand tennis stroke at waist height is often also called an ideal strike zone. 🎾 Free Forehand POWER COURSE: https://www.feeltennis.net/forehand-power-course/...", "duration": 518.0, "view_count": 16022, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "vgtBY_7E8lo", "url": "vgtBY_7E8lo", "title": "Tennis SERVE - How to \"swing the bag\" the right way", "description": "Swing the bag drill or any other tennis serve drill with a sock or ServeMaster is just an exercise first and you shouldn't treat it like an actual serve. You need to focus on basic biomechanics...", "duration": 718.0, "view_count": null, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "q9MsG0GhCuk", "url": "q9MsG0GhCuk", "title": "Guidelines For Hitting Low Contact Tennis Forehands And Backhands", "description": "Hitting forehands and backhands at different heights requires not only technical adjustments of the tennis stroke but also tactical.\n\nI've prepared a 3-part video series where you'll learn...", "duration": 697.0, "view_count": 24774, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "d_EqP8ahPUY", "url": "d_EqP8ahPUY", "title": "Tennis SERVE - What Comes First - Toss or Technique?", "description": "I think this video explains the topic clearly so I won't be recording an intro. The question I try to answer in the video is why it's not good to adjust your serve technique to your existing...", "duration": 494.0, "view_count": null, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "KASq2ujlvLc", "url": "KASq2ujlvLc", "title": "MENTAL Tennis - What Really Wins Matches And How To Get Tougher", "description": "What does it really take to win a lot of matches? This is the full \"pep talk\" ;) with my student Philip where I share my views on what it takes to win tennis matches. You might have seen a...", "duration": 984.0, "view_count": null, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "eqZ2gJWCO-4", "url": "eqZ2gJWCO-4", "title": "What It Takes To Win Tennis Matches Consistently", "description": "What does it really take to win tennis matches consistently? I hope the video above will drive the point home with by combining three different clips with the same message: my own explanation...", "duration": 658.0, "view_count": 18595, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "3JQQ_5dp3Ys", "url": "3JQQ_5dp3Ys", "title": "TENNIS TIPS - How To Manage Your Weaker Stroke", "description": "I think this video explains the topic well so I didn't record any intro to it. It's about understanding how to deal with a tennis stroke that is not natural to you. Just follow along and if...", "duration": 315.0, "view_count": null, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "7fhdmxhdiA8", "url": "7fhdmxhdiA8", "title": "Tennis VOLLEY - Direction and Depth Control And Using More Body Weight", "description": "In this video you'll see a volley drill that I almost always do with tennis players who want to develop or improve their volleys. In this particular drill I ask Allen to hit the doubles alley...", "duration": 356.0, "view_count": null, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "IRbSxw8j_lc", "url": "IRbSxw8j_lc", "title": "Tennis VOLLEY - Why I Teach Controlled Volley First (And Not Punch)", "description": "The usual teaching of the volley is that you should punch it but in my view that's an advanced skill as you're then attacking the ball. Players should learn to control the volley first and...", "duration": 254.0, "view_count": null, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "sBWGVUKQnRg", "url": "sBWGVUKQnRg", "title": "Top Spin Tennis Serve Tip - Getting A Bit More Spin, Power And Control", "description": "There are very few tennis tips that actually work very fast but this topspin serve tip actually does. ;) 🎾 Free Second Serve CONSISTENCY COURSE: https://www.feeltennis.net/second-serve-tips/...", "duration": 355.0, "view_count": 48077, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "Izkaun5VTMU", "url": "Izkaun5VTMU", "title": "Tennis TIPS - We Hit Topspin Also To Waste Energy", "description": "Did you know that one of the reasons why we hit groundstrokes with topspin is so that we waste energy? ;) And have you ever considered that the court is too short the way it was designed? Watch...", "duration": 748.0, "view_count": null, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "QqzI7kcN_rE", "url": "QqzI7kcN_rE", "title": "Tennis FOREHAND -  Why Open Stance Does Not Come Naturally", "description": "Almost all adult recreational tennis players use open stance here and there (not often enough) when they hit forehands but they execute the stance poorly. They don't use the outside leg well...", "duration": 317.0, "view_count": null, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "KZBm5AsDleU", "url": "KZBm5AsDleU", "title": "Why Hitting Tennis Strokes In The Net Sucks", "description": "Whether you practice in a free hitting sessions, you're doing some drills or you play a match, you will always need to adjust the height, depth and speed of your shots.\n\nSo in today's video...", "duration": 491.0, "view_count": 14962, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "pDcNFc4mROY", "url": "pDcNFc4mROY", "title": "Tennis SERVE - Flat vs Topspin Differences in Body Rotation", "description": "When we hit a topspin tennis serve we need to \"hold\" the body rotation at some point during the serve in order to maintain the right swing path across the ball. So in this video I am explaining...", "duration": 702.0, "view_count": null, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "6ZpfQze0ucQ", "url": "6ZpfQze0ucQ", "title": "Tennis TACTICS - How to practice against weaker players (and your friends)", "description": "I often played points against my friends and I was way better than most of them. So obviously I didn't want to beat them 6:0 as they would feel bad and I didn't want my friends to suffer. So...", "duration": 240.0, "view_count": null, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "yUg4wGihbOo", "url": "yUg4wGihbOo", "title": "More Powerful Tennis Strokes Through Trampoline Effect", "description": "In today's video I am sharing a simple idea that can help you get some extra power (and comfort) on almost all tennis strokes. https://www.feeltennis.net/wrist-power/\n\nYour racket is designed...", "duration": 997.0, "view_count": 43534, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "AbI2u36c23o", "url": "AbI2u36c23o", "title": "Tennis FOREHAND The Simplest Mental Image : Stability - rotation - swing", "description": "There's a lot of information about each of the tennis strokes and it's many times conflicting. But if we break down the forehand to its essence, then it's just based on three major things:...", "duration": 404.0, "view_count": null, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "xlWh9RZ-MHM", "url": "xlWh9RZ-MHM", "title": "Cancha Tennis Bag Review", "description": "You can get the Cancha tennis bag at a 10% discount, just head over to https://www.canchabags.com and use coupon code FEELTENNISCB10.\n\nThe Cancha bag is the first tennis bag that I am reviewing...", "duration": 755.0, "view_count": 6889, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "B6171QOxOwI", "url": "B6171QOxOwI", "title": "Poor Consistency Of Tennis Strokes? Don't \"FIRE\" The Stroke!", "description": "If you are struggling with the consistency of tennis strokes, you may be \"firing\" the stroke. 🎾 Free One-Handed Backhand CONSISTENCY COURSE: https://www.feeltennis.net/1h-backhand-course/...", "duration": 922.0, "view_count": 50571, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "emC1uyiMXNo", "url": "emC1uyiMXNo", "title": "Tennis BASICS - Always Start With Hitting Too High And Too Long", "description": "The first idea in this video is that you should always hit up even if just for a couple of degrees. The second one is that it's much easier to adjust and find the right height and depth of...", "duration": 293.0, "view_count": null, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "TP2kcdLxCvo", "url": "TP2kcdLxCvo", "title": "Tennis SERVE - Why Everyone Starts With Waiter's Tray", "description": "The so called \"waiter's tray\" in a tennis serve is a common mistake and I am explaining to my student that it's completely normal to have such a flaw because basically everyone starts serving...", "duration": 470.0, "view_count": null, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "ZnI-eTikAdw", "url": "ZnI-eTikAdw", "title": "BACKHAND SLICE Drills Part 2", "description": "More drills on the backhand slice. While the player is already showing improvements in the quality of the slice, the work is not done like many would think. I would continue these and similar...", "duration": 927.0, "view_count": null, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "ON7PuOQJdMw", "url": "ON7PuOQJdMw", "title": "BACKHAND SLICE  - Journey To a Good Slice and Drills Part 1", "description": "The backhand slice is quite a natural stroke for some players but if that's not you then you will have to work on it, suffer with it and go through lots of frustration - just like I did. The...", "duration": 1380.0, "view_count": null, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "Jhhb0MiGiTo", "url": "Jhhb0MiGiTo", "title": "BASICS Of Tennis - Finding The RYHTHM For Every Session", "description": "I am explaining why it's important to try and find a rhythm at the start of every session, how to go about it, being patient until you find it, not judging your strokes or yourself until you...", "duration": 679.0, "view_count": null, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "vcWAEcF6klU", "url": "vcWAEcF6klU", "title": "Tennis Forehand Unit Turn - It's Not A Backswing", "description": "The forehand unit turn idea part 2 is in the Membership area and the following link will show you which videos are already available inside: https://www.youtube.com/playlist?list=UUMOTK9oKMGU0XIQpL...", "duration": 551.0, "view_count": 40200, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "uNyCiTS_odY", "url": "uNyCiTS_odY", "title": "FOREHAND Control - Put Body Mass Into The Ball", "description": "The moment you start your forehand preparation you need to start a forward momentum with your upper body. That doesn't mean you move forward but you need to lean forward. That will provide...", "duration": 861.0, "view_count": null, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "eK3AmwNRAUk", "url": "eK3AmwNRAUk", "title": "Mental Tennis - How Competition Transforms You", "description": "Why competition makes you more and more competitive (if you can keep up and adjust your mindset) and how things then get ugly.\n\nThis also relates to the public video on the competition:\n\nhttps://ww...", "duration": 557.0, "view_count": null, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "TQk1KjxFFLE", "url": "TQk1KjxFFLE", "title": "Tennis Volley - How The Idea Of CATCHING Applies To Volleys", "description": "The volley is \"like catching\" - is a popular phrase among tennis coaches. In this short clip I do my best to demonstrate this approach to Allen.", "duration": 606.0, "view_count": null, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "s00G03gd2No", "url": "s00G03gd2No", "title": "Tennis Tactics - Depth And Angles", "description": "There are two keys to playing smart tennis: play the shots really deep in order to neutralize your opponent and force mishits and look to open up the court with shorter cross court shots at...", "duration": 316.0, "view_count": null, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "lybJ5AQrHME", "url": "lybJ5AQrHME", "title": "Backhand Slice Video Analysis - over-rotation and chopping", "description": "The side by side analysis of the backhand slice shows very clearly that the player rotates too much as they are hitting the backhand.", "duration": 306.0, "view_count": null, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "Zfc2Drw263I", "url": "Zfc2Drw263I", "title": "Mental & Footwork Tennis Issue - Why Players Get Too Close To The Ball", "description": "Tennis players often get to close to the ball and they think it's just a ball judgment issue or experience but it's not always the case. In most cases the player over-runs the ball because...", "duration": 113.0, "view_count": null, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "9msLFmROUVc", "url": "9msLFmROUVc", "title": "The Main Source Of Power On A Tennis Forehand", "description": "Tennis players tend to complicate and break down the technique of their forehand when they want more power. But the main source of power is simply body rotation and that's where you need to start.", "duration": 91.0, "view_count": null, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "I98901LtqVM", "url": "I98901LtqVM", "title": "Why Are Players Not Aware Of Balance In Tennis", "description": "I share why players don't realize they are off balance and how important it is to plant your foot well on the ground before hitting. There is a magical connection between the stability of your...", "duration": 142.0, "view_count": null, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "aW4USxVqjYo", "url": "aW4USxVqjYo", "title": "Which Tennis Return Of Serve Grip Is Best?", "description": "Tennis players often wonder what is the best grip for returning serves. Here's a question I received from one such player:\n\nWhen waiting to return serve, should the grip you wait with be:\n...", "duration": 519.0, "view_count": 12380, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "YoVwM_dFc1Q", "url": "YoVwM_dFc1Q", "title": "Is There A Happy End In The Tennis Competition Journey?", "description": "The start of the year is when we usually make longer term plans and perhaps you have decided that this year you'll engage yourself more in the tennis competition world, of course at your current...", "duration": 1221.0, "view_count": 12528, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "aVXYwISekGg", "url": "aVXYwISekGg", "title": "How Tennis Slice Strokes With Open Racket Face Work", "description": "If you're struggling with applying more slice / backspin and height on slice based tennis strokes like slices, volleys, drop shots and slice lobs, then you may not the \"trusting the slice\"!...", "duration": 1405.0, "view_count": 18549, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "Q5Ex1uJCtUI", "url": "Q5Ex1uJCtUI", "title": "One-handed Backhand - Topspin Vs Slice Tennis Technique Comparison", "description": "I have the last video of 2021 ready for you today and it's a comparison between the one-handed backhand topspin vs the slice backhand tennis techniques.\n\nWhile it may seem that at first glance...", "duration": 873.0, "view_count": 65496, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "sOovDG5wjuo", "url": "sOovDG5wjuo", "title": "How To Better Imagine A Tennis Ball Trajectory From The Baseline", "description": "Why do tennis players often times play the ball so low over the net and risk so many errors in the net?One of the possible reasons is that they don't really see good trajectory of the ball...", "duration": 347.0, "view_count": 29544, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "dFPBW4TMF2Q", "url": "dFPBW4TMF2Q", "title": "Why You Should (Almost) Always Hit The Ball Up In Tennis", "description": "How should you hit a tennis forehand and backhand to have a high consistency of shots? Here's a simple tennis tip: always play the ball up.\n\nSo let me show you what's the usual idea that players...", "duration": 609.0, "view_count": 53165, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "YmxOeDbMP8E", "url": "YmxOeDbMP8E", "title": "5 Key Differences Between The Forehand And One-Handed Backhand Tennis Strokes", "description": "Comparing the forehand and the one-handed backhand tennis technique and feel may seem unusual at first glance as they are in a way completely different strokes. 🎾 Free One-Handed Backhand...", "duration": 684.0, "view_count": 42531, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "mJKuzCZB77s", "url": "mJKuzCZB77s", "title": "Hitting A Tennis Overhead In The Air Or Letting It Bounce? Here's How To Decide...", "description": "When you're facing a lob you need to quickly decide whether to hit the tennis smash in the air or whether it's better letting it bounce.\n\nThe decision process might be tricky so I've recorded...", "duration": 684.0, "view_count": 15789, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "88aI5H11HNo", "url": "88aI5H11HNo", "title": "5 Tips For A Killer Tennis Smash On The Bounce", "description": "https://www.feeltennis.net/smash-on-bounce/\n\nOne of the most frustrating situations in a tennis match is when your opponents throws a lob way too short so that it bounces in the service box...", "duration": 776.0, "view_count": 30607, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "e6EL3n8FTuA", "url": "e6EL3n8FTuA", "title": "How And Why To Nurture A Tennis Swing", "description": "One of the keys to effortless power on tennis groundstrokes is to swing the racket into the ball.\n\nBy \"swing\" I refer to the downward swing that feels like a pendulum and which will automatically...", "duration": 748.0, "view_count": 31736, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "0HvTpRIhYco", "url": "0HvTpRIhYco", "title": "Tennis Serve Tactics - How To Hit 22 Different Serves", "description": "Making your serve unpredictable is an often overlooked tennis serving tactics. 🎾 Free Topspin Serve CONSISTENCY COURSE: https://www.feeltennis.net/second-serve-tips/\n\nWhen you're improving...", "duration": 1057.0, "view_count": 30370, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "SHB7xsIPv5E", "url": "SHB7xsIPv5E", "title": "Common Tennis Forehand & Backhand Weight Transfer Mistake", "description": "One of the more common misconceptions in tennis when it comes to forehands and backhands is how to transfer weight well into the ball.\n\nPlayers often times misinterpret the idea of weight transfer...", "duration": 378.0, "view_count": 36762, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "7_maCuLjsdU", "url": "7_maCuLjsdU", "title": "Game Based Forehand Topspin Tennis Drills", "description": "We're completing the forehand topspin drills today with part 2 which focuses more on game based drills that develop topspin.\n\nGame based approach in tennis means that we teach a certain technique...", "duration": 1082.0, "view_count": 25681, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "Rrdpl_eb0Xw", "url": "Rrdpl_eb0Xw", "title": "Tennis Serve Pronation Drill Over The Fence (use of index finger)", "description": "This tennis serve pronation drill is very useful as it teaches the players to \"hit up on the ball\" and also pronate. Players mistakenly believe that pronation is a movement that has to be done...", "duration": 375.0, "view_count": null, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "xjqhxgyGDTM", "url": "xjqhxgyGDTM", "title": "Tennis Forehand Topspin Drills Part 1 - Getting The Topspin Technique Right", "description": "Always wanted to hit your tennis forehand with more topspin but you don't know what drills can help you achieve that? 🎾 Free Forehand POWER COURSE: https://www.feeltennis.net/forehand-power-cour...", "duration": 1216.0, "view_count": 99209, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "mnv0O2Z3MWc", "url": "mnv0O2Z3MWc", "title": "Tennis Forehand Footwork For Attacking Short Balls", "description": "What is the right tennis forehand footwork for attacking short balls that allows you to move quickly and yet not lose balance just when you're about to hit the ball?\n\nTop pros often end up...", "duration": 366.0, "view_count": 18627, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "hNmLeq2v4qw", "url": "hNmLeq2v4qw", "title": "One-Handed Backhand Tips For Mastering 5 Tough Tennis Situations", "description": "The following one-handed backhand tips help you deal with five challenging tennis situations like handling fast balls, getting more arc and topspin and others. 🎾 Free One-Handed Backhand...", "duration": 1056.0, "view_count": 179931, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "k0ssL7Sc6WA", "url": "k0ssL7Sc6WA", "title": "Tennis Wrongfoot Psychology - Why I Don't Get Wrongfooted At All", "description": "The wrongfooting shots in tennis can be very effective but also dangerous when you play skilled opponents. When I used to play competitively I did not let my opponent wrongfoot me.\n\nNot only...", "duration": 419.0, "view_count": 13246, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "JDf-z5PmgjI", "url": "JDf-z5PmgjI", "title": "Apeak Review - Improving Tennis Mental Toughness Through Smart AI App", "description": "Apeak has granted all FeelTennis viewers a special 10% discount on the first year of subscription. Redeem by clicking this link: https://www.apeak.com/redeem/FEEL10\n\nThe one area of tennis...", "duration": 787.0, "view_count": 3638, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "3rWmhRpxoXY", "url": "3rWmhRpxoXY", "title": "Beginner Level One-Handed Backhand In 3.5 Steps", "description": "When we teach tennis beginners or correct one-handed backhand problems we need to give the player a more simple foundation as they will succeed quicker with it. 🎾 Free One-Handed Backhand...", "duration": 424.0, "view_count": 26424, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "gU0ueKnfePY", "url": "gU0ueKnfePY", "title": "How To Hit A Tennis One-Handed Backhand In 6 Steps", "description": "Learning how to hit a tennis one-handed backhand stroke with correct technique is much easier when you break it down into smaller steps. 🎾 Free One-Handed Backhand CONSISTENCY COURSE: https://ww...", "duration": 1263.0, "view_count": 149156, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "97PdO1R-eoA", "url": "97PdO1R-eoA", "title": "Tennis For Beginners Teaching Method (Forehands & Backhands)", "description": "The teaching method for tennis beginners is different to what you usually see online or even on tennis courts. We don't start with the unit turn but we teach tennis beginners to start the forehand...", "duration": 472.0, "view_count": 40932, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "F-Z6U-0jm_k", "url": "F-Z6U-0jm_k", "title": "How To Transfer Weight In Tennis Groundstrokes For More Power & Control", "description": "https://www.feeltennis.net/weight-transfer-tip/\n\nLearning how to use weight transfer in tennis is not that difficult but with so much conflicting information out there it may confuse you. ...", "duration": 533.0, "view_count": 31344, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "f98BErJH1kc", "url": "f98BErJH1kc", "title": "Most Common Tennis Serve Visual Illusions", "description": "Today we're taking a look at the most common tennis serve visual illusions which is the last video on this topic. 🎾 Free Second Serve CONSISTENCY COURSE: https://www.feeltennis.net/second-serve-...", "duration": 670.0, "view_count": 46697, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "ioLiPB8_0W0", "url": "ioLiPB8_0W0", "title": "Most Common Visual Misinterpretations Of The Forehand & Backhand Technique", "description": "https://www.feeltennis.net/visual-learning/\n\nToday we're looking at some common visual illusions of the forehand, backhand and the volley.\n\nThese are the ones I have encountered most times...", "duration": 787.0, "view_count": 60083, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "Rl1jhxO_9lY", "url": "Rl1jhxO_9lY", "title": "Deconstructing The One- And Two Handed Tennis Backhand Backswing", "description": "If you are looking to develop a correct tennis one-handed backhand backswing then it's important that you know how to observe it well. 🎾 Free One-Handed Backhand CONSISTENCY COURSE: https://www....", "duration": 633.0, "view_count": 27924, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "guUg4hVI1AE", "url": "guUg4hVI1AE", "title": "Deconstructing A Tennis Forehand Backswing", "description": "A tennis forehand backswing is a very simple and short move and yet it's often times executed incorrectly because players see the backswing as a big arm swing. Click here for a full explanation:...", "duration": 734.0, "view_count": 46708, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "0a7s64RgJOs", "url": "0a7s64RgJOs", "title": "6 Drills For Better Use Of Non-Hitting Arm On The Forehand (Part 2)", "description": "In this video you'll learn 6 different exercises that will help you improve the function of the non-hitting arm of a tennis forehand stroke.\n\nIf you've missed Part 1 I recommend you check it...", "duration": 823.0, "view_count": 34886, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "gyZxjDlmp2I", "url": "gyZxjDlmp2I", "title": "The Non-Dominant Arm Position Of A Tennis Forehand Explained", "description": "How important is the non-dominant arm when hitting a tennis forehand stroke? As you will learn today the movements of the non-hitting arm on the forehand are actually caused by upper body rotation...", "duration": 1017.0, "view_count": 91125, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "ibsasxDSsFI", "url": "ibsasxDSsFI", "title": "How Shoulder Rotation In Tennis Forehands & Backhands Adds Power And Control", "description": "Shoulder rotation is one of the fundamentals of tennis technique as it provides easy power and good control for both forehand and backhand strokes.\n\nMany tennis players struggle with their...", "duration": 810.0, "view_count": 61925, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "c9glLgadcas", "url": "c9glLgadcas", "title": "How To Get Power From Your Hips In Tennis", "description": "https://www.feeltennis.net/hip-rotation/\n\nThe hip rotation is usually missing at recreational tennis level when players hit forehands and two-handed backhands. It's typically better for one-handed...", "duration": 1222.0, "view_count": 65701, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "uQMMVRqIL7s", "url": "uQMMVRqIL7s", "title": "Armbeep Review - A Tennis Sensor For Competitive Tennis Players", "description": "Get Armbeep here: https://bit.ly/3pGNJBK\n\nIf you're into data tracking and you're already using a smartwatch or another fitness tracker then you may be interested in a new tennis tracker developed...", "duration": 616.0, "view_count": 7745, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "ivmUjbzSX9A", "url": "ivmUjbzSX9A", "title": "Tennis Technique Drills With The Slinger Bag Ball Machine", "description": "https://www.feeltennis.net/ball-machine-drills/\n\nA few weeks ago I reviewed the Slinger Bag tennis ball machine which covered mostly how to operate it and what are its main features.\n\nBut today...", "duration": 1555.0, "view_count": 57975, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "NLoJim35pSk", "url": "NLoJim35pSk", "title": "Reviewing The Slinger Bag Tennis Ball Machine", "description": "https://www.feeltennis.net/slingerbag-review/\n\nI have been asked quite a few times in recent years what tennis ball machine I would recommend but I didn't really have a good answer. But today...", "duration": 1477.0, "view_count": 75239, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "1vxiFqELj3c", "url": "1vxiFqELj3c", "title": "How To Feel More Time In Tennis And Not Be Rushed", "description": "https://www.feeltennis.net/experience-more-time/\n\nHitting the ball late is one of the biggest challenges in tennis on a recreational level.\n\nI will go more in depth on why that happens and...", "duration": 714.0, "view_count": 59656, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "1X5cxHGZp_I", "url": "1X5cxHGZp_I", "title": "Why You Could Be Hitting The Ball Too Hard In Tennis", "description": "I am back with another video related to playing speeds and this one explains one key reason why you are hitting the ball too hard (playing tennis too fast).\n\nWe're going to take a look at how...", "duration": 573.0, "view_count": 34196, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "8NH375yLH7A", "url": "8NH375yLH7A", "title": "Do You Know Your Speed Limit in Tennis?", "description": "https://www.feeltennis.net/more-power/\n\nOne of the most common questions in tennis is \"How can I hit forehand / backhand / serve with more power?\"\n\nWhat players often times forget is that more...", "duration": 1163.0, "view_count": 30797, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "dVHAhvTos6s", "url": "dVHAhvTos6s", "title": "The One-Handed Backhand Grip In Tennis Explained", "description": "If you've been playing a one-handed backhand for a while then it's very likely that your grip is already correct and allows you good control of the racket and the tennis ball. 🎾 Free One-Handed...", "duration": 505.0, "view_count": 99125, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "VTm1Y8R4DvA", "url": "VTm1Y8R4DvA", "title": "How To Hold A Tennis Racket And Feel The Grip", "description": "The usual instruction on how to hold a tennis racket correctly is typically based on how to place the V on the racket handle based on bevels or where to place the base knuckle of the index...", "duration": 1620.0, "view_count": 131006, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "T1hA6ZtQfdU", "url": "T1hA6ZtQfdU", "title": "Practicing Tennis At Home - The 15 Minute Two Handed Backhand Workout", "description": "We're now completing the tennis at home series of workouts and today's stroke is the two-handed backhand.\n\nYou can practice the two-handed backhand at home or at any area where you have a few...", "duration": 1268.0, "view_count": 60709, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "NEDQ-dBMWOM", "url": "NEDQ-dBMWOM", "title": "Tennis At Home Workout - Rebuilding The One-Handed Backhand Technique (Part 2)", "description": "Follow along this \"tennis at home\" one-handed backhand workout that focuses on the biomechanical fundamentals of the backhand. 🎾 Free One-Handed Backhand CONSISTENCY COURSE: https://www.feeltenn...", "duration": 1062.0, "view_count": 53127, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "ja7-Cx7hGso", "url": "ja7-Cx7hGso", "title": "Tennis At Home Practice - Rebuilding The Forehand Technique (Part 1)", "description": "The following tennis at home practice session lasts only about 15 minutes and helps you improve the forehand technique.\n\nYou can do this tennis workout at home or somewhere off court as you...", "duration": 1835.0, "view_count": 135789, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "qk9NIk5RasY", "url": "qk9NIk5RasY", "title": "How To Activate Your Lower Body Before A Tennis Session", "description": "The exercises in today's video can be used as a part of the \"tennis at home\" sessions but also as an activation part of the warm up before you even step on the court.\n\nThey focus on the legs...", "duration": 1422.0, "view_count": 32436, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "R_XGDBhTfl0", "url": "R_XGDBhTfl0", "title": "4 Simple Drills For Improving Balance In Tennis", "description": "https://www.feeltennis.net/improving-balance/\n\nThis is part 2 of Balance in Tennis and in this video you can learn 4 simple drills that help you improve your balance and stability on your forehands...", "duration": 1015.0, "view_count": 53785, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "vdCquNxxado", "url": "vdCquNxxado", "title": "Tennis Balance - Priority #1 In Stroke Correction (Part 1)", "description": "https://www.feeltennis.net/balance/\n\nBalance (or stability) is the key to consistent and powerful forehands and backhands and is one of the most important tennis fundamentals.\n\nIf you're not...", "duration": 1681.0, "view_count": 114059, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "R5H_KcjBBxs", "url": "R5H_KcjBBxs", "title": "7 Tips For Fixing A Tennis Forehand On Your Own (With A Ball Hopper)", "description": "https://www.feeltennis.net/forehand-fundamentals/\n\nIf you're looking for tennis forehand tips on technique, the swing and stances and you have no one to play with, look no further. \n\nIn this...", "duration": 1685.0, "view_count": 310883, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "0nBOk3SLGy0", "url": "0nBOk3SLGy0", "title": "The Key To Accurate Tennis Serve Toss - Holding The Ball Correctly", "description": "https://www.feeltennis.net/hold-ball-serve-toss/\n\nAlways wanted to know how exactly to hold the tennis ball for the service toss but were never sure?\n\nOne of the questions that I receive often...", "duration": 716.0, "view_count": 183493, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "r3SWInoeolI", "url": "r3SWInoeolI", "title": "5 Tips For Better Tennis Returns (Of Serve)", "description": "Today I am sharing 5 tennis tips on the return of serve which I recorded during one of my lessons.\n\nYou'll learn how to split step differently making sure you're hitting with a forward momentum,...", "duration": 345.0, "view_count": 49023, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "JYFWQJCeN5c", "url": "JYFWQJCeN5c", "title": "Tennis Serve Pronation Explained For Flat, Slice & Topspin Serves", "description": "Understanding tennis serve pronation for flat, slice and topspin serves is just the start, you have to do the right drills to improve it. Here's how: https://www.feeltennis.net/serve-challenge/...", "duration": 990.0, "view_count": 194158, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "5LOKkHpFpFU", "url": "5LOKkHpFpFU", "title": "How To Hit A Tennis Forehand - 3 Simple Concepts", "description": "Learning to hit a forehand in tennis can become quite a complicated process if you start complicating with technique.\n\nBut you can also see hitting a forehand in a much more simple way through...", "duration": 435.0, "view_count": 45337, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "bIRWsYHLc7I", "url": "bIRWsYHLc7I", "title": "How To Return A Drop Shot In Tennis - Top 4 Tactical Plays", "description": "Not sure how to return a drop shot in tennis? Learn how to beat a drop-shot tennis player with the following smart tactical plays:\n\nGuideline #1: Play the ball deep down the line and cover...", "duration": 219.0, "view_count": 36251, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "3gKK6TTrMro", "url": "3gKK6TTrMro", "title": "Drop Shot Tennis Tactics - 7 Dos And Don'ts", "description": "https://www.feeltennis.net/drop-shot-tactics/\n\nToday we're continuing with the tennis drop shot series of videos and this part 2 covers the tactical part.\n\nA drop shot is a double edged sword...", "duration": 666.0, "view_count": 44412, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "0MhJ74Ehn4s", "url": "0MhJ74Ehn4s", "title": "The Basics Of Drop Shot Technique & Tennis Drills For Feel", "description": "https://www.feeltennis.net/drop-shot-technique/\n\nToday we're first looking at the tennis drop shot techniques both on the forehand and backhand side and how they compare to the usual forehand...", "duration": 662.0, "view_count": 79971, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "oueff-0mNJA", "url": "oueff-0mNJA", "title": "Ideal Tennis Practice / Rally Conditions", "description": "https://www.feeltennis.net/fundamental-rally-conditions/\n\nYou've found some interesting tennis tip online and you would now like to work on your stroke technique and see if you can implement...", "duration": 605.0, "view_count": 29832, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "YG8C8RVNaLY", "url": "YG8C8RVNaLY", "title": "Learning To Play Tennis Groundstrokes With More Power", "description": "While most players in my opinion play with too much power for their current skill level, there is a tennis player here and there that needs a bit of encouragement to add more pace to his forehands...", "duration": 493.0, "view_count": 31206, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "GzX2C30O2ic", "url": "GzX2C30O2ic", "title": "Tennis Fundamentals - Forehand & Backhand Biomechanics From The Ground Up", "description": "https://www.feeltennis.net/fundamental-tennis-techniques/\n\nSpecial thanks to Ian Westermann from https://www.youtube.com/user/EssentialTennis for letting me use some of his footage for this...", "duration": 801.0, "view_count": 72638, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "wbB2LoFi04k", "url": "wbB2LoFi04k", "title": "Tennis Serve Positioning For Deuce & Ad Directions", "description": "What is the difference in positioning on your tennis serve if you serve to the deuce or if you serve to the ad side?\n\nThe difference is very small. In my case I align my feet in the direction...", "duration": 390.0, "view_count": 56753, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "gXgSuDDEIeY", "url": "gXgSuDDEIeY", "title": "The Lines On A Tennis Court Do NOT Tell You Where To Position!", "description": "I see time and time again how players stand too close to the lines and how that troubles them from the moment they start playing and warming up.\n\nThis video looks at playing mini tennis at...", "duration": 278.0, "view_count": 56370, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "8GOzHiO2BRc", "url": "8GOzHiO2BRc", "title": "Mental Tennis Talk Part 2 - Trusting Your Strokes", "description": "Today I am sharing with you the part 2 of my mental tennis talk and it's on the topic of trusting your strokes.\n\nSimply put, if you don't trust your strokes, you cannot play well, no matter...", "duration": 958.0, "view_count": 29029, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "L_YtHs0tm4o", "url": "L_YtHs0tm4o", "title": "Mental Tennis Talk Part 1 - Accepting Mistakes", "description": "https://www.feeltennis.net/how-to-be-at-peace-with-mistakes-in-tennis/\n\nTennis is in my view one of the most difficult sports to play let alone to master and we constantly make mistakes as...", "duration": 739.0, "view_count": 25661, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "7mZ89vRJV8Q", "url": "7mZ89vRJV8Q", "title": "The Goal Of A Tennis Lesson", "description": "If you're having a tennis lesson with your coach you need to know what the actual goal of that single tennis lesson is.\n\nMost tennis players are too focused on trying to correct their strokes...", "duration": 269.0, "view_count": 15781, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "TqEU9KNZbBE", "url": "TqEU9KNZbBE", "title": "A Tactical Goal Of A Recreational Tennis Backhand", "description": "Wolfgang was looking for a power on the one-handed backhand and I explain to him my views on the tennis tactics of playing a backhand. 🎾 Free One-Handed Backhand CONSISTENCY COURSE: https://www....", "duration": 271.0, "view_count": 38438, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "s5LaEPpD7o8", "url": "s5LaEPpD7o8", "title": "Is Tennis Serve Pronation Natural?", "description": "Just showing how the pronation on a tennis serve \"wants\" to happen naturally if you see and understand how the wrist wants to move in relation to the forearm.", "duration": 226.0, "view_count": 21483, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "f8lVPewF-mc", "url": "f8lVPewF-mc", "title": "4 Keys To Correct Tennis Serve Contact Point", "description": "https://www.feeltennis.net/tennis-serve-contact/\n\nAs you know a tennis serve is the most complex stroke in tennis and there is tons of analysis done on it.\n\nIn fact you can get overwhelmed...", "duration": 814.0, "view_count": 235707, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "s8EViFsVDQY", "url": "s8EViFsVDQY", "title": "Correcting A Two-Handed Backhand Tennis Stroke - What's The Mental Image", "description": "https://www.feeltennis.net/diagnose-stroke-problems/\n\nSince I rarely work with beginners I spend most of time correcting stroke techniques instead of teaching and developing them from scratch....", "duration": 822.0, "view_count": 143148, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "JdKz9hA3yQE", "url": "JdKz9hA3yQE", "title": "The \"Grazing\" Tennis Topspin & How To Feel It", "description": "https://www.feeltennis.net/how-to-feel-topspin/\n\nThere are many ways of teaching and explaining to players what a topspin in tennis is. \n\nWe can use various devices or various exercises to...", "duration": 337.0, "view_count": 26981, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "P5Q2Lc9AllM", "url": "P5Q2Lc9AllM", "title": "Analyzing A Tennis Serve & Improving The Toss Height", "description": "https://www.feeltennis.net/serve-higher-toss/\n\nThis week's video article shows you how to thoroughly analyze a tennis serve not only from the technical / mechanical point of view but also from...", "duration": 1167.0, "view_count": 76671, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "cKeSQHjm4gM", "url": "cKeSQHjm4gM", "title": "The Most Fundamental Tennis Serve Drills", "description": "https://www.feeltennis.net/tennis-serve-fundamentals/\n\nThe serve is the most complex stroke in tennis and it shows - most players struggle with it.\n\nBut underneath the technical complexity...", "duration": 1398.0, "view_count": 158985, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "RkusgvnxT3U", "url": "RkusgvnxT3U", "title": "Building Tennis Technique Based On Biomechanics (Part 3)", "description": "https://www.feeltennis.net/tennis-technique-biomechanics/\n\nIn part 3 with my conversations with Colin you'll learn how in my view tennis technique needs to be taught.\n\nIt needs to be taught...", "duration": 810.0, "view_count": 13573, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "PvzFwH7xmI8", "url": "PvzFwH7xmI8", "title": "The Long Term Development Of Tennis Technique (Part 2)", "description": "https://www.feeltennis.net/tennis-technique-development/\n\nThis is part 2 of my talks with Colin about the tennis technique and how we need to develop it.\n\nToday we're talking about the long...", "duration": 605.0, "view_count": 12782, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "2ei3A6ks-dc", "url": "2ei3A6ks-dc", "title": "Better Tennis Technique & Better Car Analogy (Part 1)", "description": "https://www.feeltennis.net/improving-tennis-technique/\n\nI've had an interesting conversation with one of my students about improving tennis technique - and luckily I've recorded it.\n\nToday...", "duration": 498.0, "view_count": 10444, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "Zm9RJk15ljQ", "url": "Zm9RJk15ljQ", "title": "Rule #1 In Learning Tennis: Don't Overwhelm Yourself", "description": "https://www.feeltennis.net/avoid-over-thinking/\n\nOne of the most common mistakes when you're learning tennis on your own or when your coach is teaching you is that there is too much information...", "duration": 320.0, "view_count": 21075, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "UlgLRhGefm0", "url": "UlgLRhGefm0", "title": "Swing A Tennis Racket Like A Weight Instead Using It Like A Tool", "description": "https://www.feeltennis.net/racket-swing/\n\nOne of the most common problems in the game of tennis is that players don't use their whole body to hit strokes and they don't swing their rackets....", "duration": 1297.0, "view_count": 219873, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "EWrlCzQV4Hk", "url": "EWrlCzQV4Hk", "title": "Open Or Neutral Stance Tennis Forehand? Pros & Cons", "description": "https://www.feeltennis.net/open-vs-neutral-forehand/\n\nThe question that I get often is whether one should play more open stance or more neutral stance forehands.\n\nThe open stance forehand has...", "duration": 658.0, "view_count": 72772, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "TKkgtnRjryc", "url": "TKkgtnRjryc", "title": "Efficient Tennis Footwork - How To Move Quickly To A Short Ball", "description": "https://www.feeltennis.net/footwork-short-balls/\n\nHow should you move to a short ball so that you end up there with enough time, in a correct stance and with your tennis stroke already prepared?...", "duration": 810.0, "view_count": 235585, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "BjgZxNbYqtU", "url": "BjgZxNbYqtU", "title": "Tennis Racket Head Acceleration For High Consistency", "description": "https://www.feeltennis.net/steady-racket-acceleration/\n\nI have a simple tennis tip for you today that may help you hit your forehands and backhands more cleanly and effortlessly.\n\nOne of more...", "duration": 394.0, "view_count": 81915, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "0QC0lAHptR8", "url": "0QC0lAHptR8", "title": "How To Play Relaxed And Accurate Tennis Groundstrokes", "description": "https://www.feeltennis.net/relaxation-and-rotation/\n\nIn today's video article you'll learn how to find the right amount of relaxation and firmness in your strokes as well as how to find the...", "duration": 717.0, "view_count": 245695, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "GeElHXkCG7g", "url": "GeElHXkCG7g", "title": "The Universal Tennis Swing And Drills To Learn It", "description": "This week's video will be of immense help to many of you who struggle with finding effortless power on your groundstrokes in your tennis game. You will learn the physics behind the so-called...", "duration": 1095.0, "view_count": 418686, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "tMWaDuZODDk", "url": "tMWaDuZODDk", "title": "How To Master A Running Forehand In Tennis", "description": "http://www.feeltennis.net/forehands-on-the-run/\n\nOne of the more challenging situations in tennis is when you have to hit a forehand on the run.\n\nYou're stretched to the side usually with a...", "duration": 791.0, "view_count": 130440, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "tyzgCIxWxZQ", "url": "tyzgCIxWxZQ", "title": "The Variations Of The Tennis Racket Head Angles At Contact", "description": "http://www.feeltennis.net/racket-head-orientation/\n\nThis week's video addresses one of the most common misconceptions in tennis when it comes the racket head orientation namely that the racket...", "duration": 301.0, "view_count": 58627, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "2xH1jAL_KNo", "url": "2xH1jAL_KNo", "title": "Unit Turn In Tennis - Fundamental Rules For Forehand & Backhand", "description": "http://www.feeltennis.net/unit-turn/\n\nYou've surely heard of the term unit turn when teaching tennis players how to prepare and initiate their forehand or backhand stroke.\n\nAt first glance...", "duration": 503.0, "view_count": 232733, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "pah2-9b89dA", "url": "pah2-9b89dA", "title": "Do Long Follow-Throughs On Tennis Forehands And Backhands Really Work?", "description": "http://www.feeltennis.net/long-follow-through/\n\nIf you've been in tennis for a while you've surely heard tips like \"stay long with the ball\", \"extend after the contact\", \"have a long follow-through...", "duration": 411.0, "view_count": 58830, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "H3K9y8ptQ0s", "url": "H3K9y8ptQ0s", "title": "Two Tennis Tips That Work Better Than \"Swing Low To High\"", "description": "http://www.feeltennis.net/dont-swing-low-to-high/\n\nHave you ever been told by your coach to swing low to high - to impart topspin or to lift the ball higher above the net?\n\nIf you were and...", "duration": 787.0, "view_count": 993160, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "mbwbpta1Bxw", "url": "mbwbpta1Bxw", "title": "How To Hit Tennis Strokes In The Ideal Strike Zone And Why", "description": "http://www.feeltennis.net/ideal-strike-zone/\n\nThe two main areas of improving your strokes are usually having better consistency and hitting with more power.\n\nBut did you know that you can...", "duration": 870.0, "view_count": 248238, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "T0FhJZuaW1E", "url": "T0FhJZuaW1E", "title": "Free Hitting - The Most Underrated Way Of Tennis Training", "description": "http://www.feeltennis.net/free-hitting/\n\nWith so much information online and on the court about tennis technique, practicing patterns of play with drills and working on your mental game, you...", "duration": 1444.0, "view_count": 198059, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "0Mf8SFX_LuI", "url": "0Mf8SFX_LuI", "title": "Classic Tennis Forehand vs Modern Forehand Technique", "description": "http://www.feeltennis.net/classic-vs-modern-forehand/\n\nHave you ever wondered what it means that the forehand is \"modern\" and how it differs from the \"classic\" tennis forehand technique?\n\nAnd...", "duration": 758.0, "view_count": 492064, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "a-Vfwm1gpp8", "url": "a-Vfwm1gpp8", "title": "Tennis Stances And 4 Drills To Master Them", "description": "http://www.feeltennis.net/neutral-open-stance/\n\nHave you found yourself struggling when playing a certain tennis stance like the open stance forehand? Or perhaps you're confused with all the...", "duration": 838.0, "view_count": 75374, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "vfsS9JAAdMc", "url": "vfsS9JAAdMc", "title": "Tennis Forehand Wrist Lag Comparison - Federer vs Halep", "description": "If you're observing the tennis pros to improve your forehand wrist lag technique, then check Roger Federer's forehand technique and how it compares to Simona Halep's. 🎾 Free Forehand POWER...", "duration": 1160.0, "view_count": 1592992, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "9KRYA9ZlYmM", "url": "9KRYA9ZlYmM", "title": "Modern Tennis Forehand Technique In 8 Steps", "description": "Developing the modern forehand technique is the key to dominating your tennis matches from the baseline and having the ability to put away short balls. 🎾 Free Forehand POWER COURSE: https://www....", "duration": 1472.0, "view_count": 1045675, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "9ouRuhLXcF8", "url": "9ouRuhLXcF8", "title": "Lots Of Small Steps For Better Tennis Footwork? It Depends...", "description": "http://www.feeltennis.net/footwork-small-steps-myth/\n\nThe instruction of making lots of small steps to improve your footwork in tennis is very common but it's often times misinterpreted. \n...", "duration": 379.0, "view_count": 41011, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "aG8tN7tUHyM", "url": "aG8tN7tUHyM", "title": "How To Keep Your Eye On The Ball In Tennis", "description": "http://www.feeltennis.net/still-head-at-contact/\n\nWatching the ball or keeping your head still at contact is one of the most common coaching advice in tennis and yet almost no recreational...", "duration": 1195.0, "view_count": 843303, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "uHZ_8oFVaBA", "url": "uHZ_8oFVaBA", "title": "How \"Lifting\" The Ball Helps You Play Better", "description": "http://www.feeltennis.net/lifting-improves-consistency/\n\nIf you're hitting a lot of shots into the net you may be imagining your groundstrokes incorrectly, meaning you're thinking in straight...", "duration": 747.0, "view_count": 366518, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "_3YjRtxdxKw", "url": "_3YjRtxdxKw", "title": "Second Serve Mindset For Tough Tennis Matches", "description": "The second serve in tennis has to be one of the most reliable strokes in your arsenal. \n🎾 Free Second Serve CONSISTENCY COURSE: https://www.feeltennis.net/second-serve-tips/\n\nPlaying a tough...", "duration": 521.0, "view_count": 109561, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "9s1-pW7Qo_o", "url": "9s1-pW7Qo_o", "title": "Advanced Topspin Technique For Fast Tennis Shots", "description": "http://www.feeltennis.net/advanced-topspin-technique/\n\nThere is a chance you're doing the topspin forehands and backhands incorrectly when you're receiving faster balls in your tennis game....", "duration": 611.0, "view_count": 502450, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "bwRG38DhLkc", "url": "bwRG38DhLkc", "title": "More Power & Spin By Better Leg Drive", "description": "http://www.feeltennis.net/using-legs-power-spin/\n\nThere's much more to using your legs than just \"bend your knees\" and this video shows you two ideas you can use that will help you engage your...", "duration": 404.0, "view_count": 47100, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "-cAAMBQycBo", "url": "-cAAMBQycBo", "title": "Tennis Sensor - Babolat PIQ Review", "description": "http://bit.ly/29Ph7TI\n\nThe Babolat PIQ sensor is a wrist worn sensor that helps you track various stats from your tennis game and I got a chance to review it.\n\nThe Babolat PIQ comes in a very...", "duration": 308.0, "view_count": 39849, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "anf4fFGl6RY", "url": "anf4fFGl6RY", "title": "Finding Best Tennis Grips And How To Quickly Change Them", "description": "http://www.feeltennis.net/forehand-backhand-grips/\n\nWhile there are many ways to hold the racket and hit your groundstrokes there are just a few different tennis grips that allow you to hit...", "duration": 369.0, "view_count": 163453, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "YzPQ21lOSi8", "url": "YzPQ21lOSi8", "title": "How To Aggressively Return Weak Tennis Serves", "description": "http://www.feeltennis.net/return-short-second-serves/\n\nWouldn't it be great if you could crush those short second serves with your return? The second serve is usually very short and slow in...", "duration": 423.0, "view_count": 828379, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "t2xJg6wOprc", "url": "t2xJg6wOprc", "title": "Why Is The Serve In Tennis So Difficult? One Main Reason...", "description": "Why is an advanced  tennis serve so difficult to learn? Join the free 30 Day Serve Challenge and finally overcome that waiter's tray position: https://www.feeltennis.net/serve-challenge/\n\nIf...", "duration": 965.0, "view_count": 1024719, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "XR83yXLla8w", "url": "XR83yXLla8w", "title": "Tennis Split Step Timing, Execution And Drills", "description": "http://www.feeltennis.net/split-step/\n\nThe timing of the split step is not easy to master that's why this video shows you some practical drills for improving your split steps.\n\nThe usual advice...", "duration": 482.0, "view_count": 247931, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "biRNoZC_Wt0", "url": "biRNoZC_Wt0", "title": "How To Return Fast Serves In Tennis", "description": "http://www.feeltennis.net/return-serve-drills/\n\nThe return of serve in tennis is one of the most challenging shots to make especially when you're facing a very fast first serve.\n\nMost tennis...", "duration": 439.0, "view_count": 585507, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "iXvWh-xMSd0", "url": "iXvWh-xMSd0", "title": "How To Stop Hitting The Ball Late", "description": "http://www.feeltennis.net/stop-hitting-ball-late/\n\nBeing late on the ball is a big challenge in tennis and the cause for it is usually late stroke preparation.\n\nAnd the reason why you prepare...", "duration": 578.0, "view_count": 1235249, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "UJ3xNfw7G3Y", "url": "UJ3xNfw7G3Y", "title": "Tame Your Serve Toss With The \"Keep Lifting\" Drill", "description": "http://www.feeltennis.net/serve-toss-drill/\n\nAre you're looking for a toss drill for a tennis serve that trains your arm to consistently place the ball in the same place? \n\nThe \"keep lifting\"...", "duration": 412.0, "view_count": 174676, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "dY5cDaPkTqU", "url": "dY5cDaPkTqU", "title": "Forehand Follow Through - To Catch Or Not To Catch", "description": "http://www.feeltennis.net/forehand-follow-through/\n\nShould you be catching your racquet on the follow-through of your forehand with your off hand? \n\nThere are two main reasons why I prefer...", "duration": 372.0, "view_count": 66552, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "hdqHZovedUw", "url": "hdqHZovedUw", "title": "The Key To Finishing Easy Balls", "description": "https://www.feeltennis.net/fewer-mistakes-power/\n\nWhen you receive an easy short ball in tennis, whether that's on a groundstroke, a volley or even a smash, you definitely want to hit it with...", "duration": 916.0, "view_count": 645040, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "ntBgpIRNHio", "url": "ntBgpIRNHio", "title": "How To Find A Proper Serving Rhythm", "description": "http://www.feeltennis.net/serve-rhythm/\n\nThe rhythm on the serve in tennis is often overlooked because it's not that obvious but it is the key to powerful and consistent serves.\n\nThat's because...", "duration": 491.0, "view_count": 143239, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "CXgfNBnetzQ", "url": "CXgfNBnetzQ", "title": "How To Serve In Tennis In 7 Steps - Serve Technique Tutorial", "description": "If you want to learn how to serve in tennis with correct technique, then follow these 7 steps that guide you through proper technical progressions. Free Serve Course: https://www.feeltennis.net/ser...", "duration": 1311.0, "view_count": 4799035, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "oor0faEKwBo", "url": "oor0faEKwBo", "title": "How To Hit A Clean Tennis Shot", "description": "http://www.feeltennis.net/why-your-strokes-lack-power/\n\nIf we hit the ball cleanly, meaning in the sweet spot, we'll also give the ball maximum power with the least amount of effort.\n\nBut there's...", "duration": 738.0, "view_count": 546032, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "1WruwNr8CJo", "url": "1WruwNr8CJo", "title": "Top 3 Drills For A Better Backhand Slice", "description": "http://www.feeltennis.net/backhand-slice-technique/\n\nOne of the most common problems when hitting a backhand slice in tennis is over-rotation.\n\nThe video above shows 3 very effective drills...", "duration": 368.0, "view_count": 184580, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "ulxImJm_1FU", "url": "ulxImJm_1FU", "title": "The Right Way Of Developing Power In Tennis", "description": "http://www.feeltennis.net/proper-path-to-power/\n\nPowerful shots in tennis are very tempting and we often times go for too much too quickly. In the process we break down our technique and make...", "duration": 446.0, "view_count": 37909, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "bii5hE-KD6U", "url": "bii5hE-KD6U", "title": "How To Play Mini Tennis With Feel And Control", "description": "http://www.feeltennis.net/mini-tennis-technique/\n\nPlaying mini tennis helps you warm up your body, eyes and mind but it's often times played incorrectly. \n\nPlayers namely still make their usual...", "duration": 362.0, "view_count": 52852, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "1sRvoT9_kbo", "url": "1sRvoT9_kbo", "title": "Milos Raonic Volley Analysis (No Racquet)", "description": "http://www.feeltennis.net/milos-raonic-volley/\n\nThanks for Jason Frausto again from http://www.TennisUnleashed.net for letting me use Milos Raonic volley videos for this analysis.\n\nThe usual...", "duration": 136.0, "view_count": 14160, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "Vl1nnWow6d4", "url": "Vl1nnWow6d4", "title": "Fernando Verdasco Backhand (No Racquet)", "description": "http://www.feeltennis.net/fernando-verdasco-backhand/\n\nThanks to Jason Frausto from http://www.tennisunleashed.net for allowing me to use Fernando Verdasco's two-handed backhand video for technique...", "duration": 290.0, "view_count": 67031, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "JtX4keRY9r8", "url": "JtX4keRY9r8", "title": "Grigor Dimitrov Backhand Analysis (No Racquet)", "description": "http://www.feeltennis.net/grigor-dimitrov-backhand/\n\nThis is another video released in collaboration with http://www.tennisunleashed.net so kudos to Jason Frausto for letting me use Grigor...", "duration": 267.0, "view_count": 128501, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "_jP2yF1OIHM", "url": "_jP2yF1OIHM", "title": "Roger Federer's Serve Technique - Racquet Digitally Removed", "description": "http://www.feeltennis.net/roger-federer-serve/\n\nSpecial thanks to Jason Frausto from http://www.TennisUnleashed.net for allowing me to use his video for this analysis.\n\nYou've seen tons of...", "duration": 258.0, "view_count": 427672, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "tW8Yh3hVG08", "url": "tW8Yh3hVG08", "title": "The Most Important Element Of Tennis For Consistency", "description": "http://www.feeltennis.net/intention/\n\nWith so much tennis instruction on technique you may start to believe that it's correct technique that puts the ball in.\n\nIt doesn't. It simply helps you...", "duration": 864.0, "view_count": 423553, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "1Y14gsjTAoM", "url": "1Y14gsjTAoM", "title": "The Swinging Up On The Serve Mystery Explained", "description": "http://www.feeltennis.net/swing-up-serve/\n\nYou've probably heard of the concept of swinging up towards the ball when serving but couldn't really figure out how will then the ball go down.\n...", "duration": 775.0, "view_count": 295704, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "AhLgX73oA1c", "url": "AhLgX73oA1c", "title": "How To Develop Smooth Tennis Strokes", "description": "http://www.feeltennis.net/key-to-consistency/\n\nThe #1 reason for not having smooth or fluid tennis strokes is the desire to hit the ball hard. \n\nThis triggers a certain response of your body...", "duration": 389.0, "view_count": 47819, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "zcd9fyRedgA", "url": "zcd9fyRedgA", "title": "How Ideal Contact Point Unlocks The Power Of Tennis Strokes", "description": "http://www.feeltennis.net/contact-point/\n\nWhile tennis technique, meaning the mechanics of the stroke, are crucial for beginners to acquire some basic skills, it's not the answer for hitting...", "duration": 724.0, "view_count": 408161, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "mb2Wz0alEjs", "url": "mb2Wz0alEjs", "title": "Throw The Racquet Into The Ball For More Power", "description": "http://www.feeltennis.net/power-and-control/\n\nIf you want to control the ball in tennis while still hit it with power, you'll need to work with throwing and pushing ratios rather then think...", "duration": 854.0, "view_count": 307273, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "kmKOdPfWdvc", "url": "kmKOdPfWdvc", "title": "How Being Comfortable Unlocks More Powerful Tennis Strokes", "description": "http://www.feeltennis.net/being-comfortable/\n\nThis is a very simple principle but it's very powerful: can you be more comfortable?\n\nAsk yourself that every time you're learning new technique...", "duration": 352.0, "view_count": 17676, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "8b96lTo4zKA", "url": "8b96lTo4zKA", "title": "How To Use Weight Transfer In Tennis For More Power", "description": "http://www.feeltennis.net/weight-transfer/\n\nIf you transfer your weight into the ball as you hit groundstrokes and volleys, you'll hit with more power as there will be greater momentum transferred...", "duration": 901.0, "view_count": 245361, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "3ncD61w69og", "url": "3ncD61w69og", "title": "3 Ways Of Breathing That Help You Play Better Tennis", "description": "http://www.feeltennis.net/breathing-in-tennis/\n\nProper breathing can do wonders for your game. It can correct your stroke technique, it can make you play longer rallies and it can help you...", "duration": 509.0, "view_count": 54048, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "o-PiQX1P0QY", "url": "o-PiQX1P0QY", "title": "Perfect Posture For Being Balanced In Tennis", "description": "http://www.feeltennis.net/balance-in-tennis/\n\nBalance is one of the most important aspects of tennis that you need to master in order to get to the next level.\n\nThis video shows you why leaning...", "duration": 306.0, "view_count": 56124, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "OW_6jXp39Vo", "url": "OW_6jXp39Vo", "title": "A Common Mistake When Learning Strokes From Tennis Pros", "description": "http://www.feeltennis.net/learning-strokes-from-pros/\n\nWhen you're studying tennis technique from the pros online here on Youtube or on another video site, you may be trying to copy parts of...", "duration": 270.0, "view_count": 28020, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "66z8R5HPxsE", "url": "66z8R5HPxsE", "title": "Watching The Ball In Tennis", "description": "http://www.feeltennis.net/watching-the-ball/\n\nHow do you watch the ball in tennis? One often overlooked part is the first part of the trajectory from the contact of your opponent until the...", "duration": 927.0, "view_count": 208850, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "f38FJxCYHQc", "url": "f38FJxCYHQc", "title": "How a Tennis Pro Watches The Ball - Borut Urh, ATP 281", "description": "A former Slovenian ATP pro Borut Urh, highest ranking ATP 281, has strapped a GoPro camera to his head to show us how he watches the ball.", "duration": 234.0, "view_count": 12938, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "f5Wks63Ng0Y", "url": "f5Wks63Ng0Y", "title": "How To Use The Ground Force In Tennis", "description": "http://www.feeltennis.net/ground-force-for-power/\n\nThe weighing scale helps you understand how to initiate the force into the ground so that the \"ground\" pushes you back.\n\nAt least that's how...", "duration": 254.0, "view_count": 20401, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "AzGaukvaJcI", "url": "AzGaukvaJcI", "title": "2 Deep Reasons Why Your Tennis Strokes Lack Depth", "description": "http://www.feeltennis.net/why-short-balls/\n\nThis time we're going deeper on why your shots lack depth.\n\nThe first reason is depth perception from the perspective behind the baseline. Even when...", "duration": 635.0, "view_count": 186971, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "bx1YYxJPRR8", "url": "bx1YYxJPRR8", "title": "Tennis Technique Improvement Through Adjusting And Repetition", "description": "http://www.feeltennis.net/technique-training-adjusting/\n\nIf you miss a stroke in tennis, you may very likely blame your stroke technique and immediately try to FIX it. What went wrong, what...", "duration": 504.0, "view_count": 28687, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "mazq4GmkdIU", "url": "mazq4GmkdIU", "title": "How to Handle Fast Balls in Tennis", "description": "http://www.feeltennis.net/how-to-deal-with-fast-balls/\n\nWhen you're receiving a fast ball in tennis and you're hitting a groundstroke, you may be late on it often.\n\nThe main reason why that...", "duration": 455.0, "view_count": 504853, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "WSfVJjb2MxE", "url": "WSfVJjb2MxE", "title": "How To Time Your Strokes On Deep Shots And Not Be Late (Again)", "description": "http://www.feeltennis.net/late-on-deep-shots/\n\nYou've all heard the phrase \"prepare early\" to avoid being late on the shot (forehand or backhand usually) but that in fact doesn't work.\n\nThe...", "duration": 741.0, "view_count": 234463, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "HeqjUS-X0rg", "url": "HeqjUS-X0rg", "title": "Roger Federer's Forehand Without The Racquet", "description": "http://www.feeltennis.net/roger-federer-forehand-technique/\n\nThanks to Will Hamilton from FYB for letting me use one of his Roger Federer's slow motion forehand videos.\n\nThe \"illusion\" I refer...", "duration": 153.0, "view_count": 131754, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "Ha7M9wYa7_k", "url": "Ha7M9wYa7_k", "title": "Top 3 Footwork Mistakes In Tennis And How To Correct Them", "description": "http://www.feeltennis.net/basics-of-tennis-footwork/\n\nThe main principle when it comes to footwork in tennis is keeping things simple.\n\nThe more you mess with your feet, the more messy your...", "duration": 851.0, "view_count": 354639, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "-s5AzvZlxRI", "url": "-s5AzvZlxRI", "title": "The Most Effortless Way of Hitting A Tennis Ball - Sweeping The Ball", "description": "http://www.feeltennis.net/fluid-strokes/\n\nThe key to having really smooth and fluid tennis strokes doesn't lie in tennis technique, it's actually about having the right mental image of how...", "duration": 261.0, "view_count": 169045, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "F8n_VUx8fbA", "url": "F8n_VUx8fbA", "title": "6 Drills For Improving A Shallow Drop In A Tennis Serve", "description": "http://www.feeltennis.net/deep-drop-serve/\n\nThe key to proper tennis serve technique is achieving a nice deep loop / drop behind your back where the racquet starts to accelerate towards the...", "duration": 1521.0, "view_count": 324829, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "o108fbM41ZA", "url": "o108fbM41ZA", "title": "How to Hit Cross Court and Down the Line in Tennis", "description": "http://www.feeltennis.net/cross-court-down-the-line/\n\nEvery tennis player can hit the ball cross court and down the line but not many are accurate and consistent doing it.\n\nPlayers usually...", "duration": 737.0, "view_count": 475238, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "-9cIObcQyME", "url": "-9cIObcQyME", "title": "7 Serve Pronation Drills For A Better Tennis Serve", "description": "http://www.feeltennis.net/serve-pronation/\n\nThe tennis serve pronation is that key technique of the serve that separates advanced and effective serves from beginner serves.\n\nIt is one of the...", "duration": 970.0, "view_count": 876962, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "wc4dpfCWGuo", "url": "wc4dpfCWGuo", "title": "How to Correct The Waiter's Serve In Tennis", "description": "http://www.feeltennis.net/correcting-the-waiters-serve/\n\nOpening of the racquet face too early in the swing is called a waiter's serve in the tennis coaching community. It's not an easy error...", "duration": 795.0, "view_count": 366800, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "SHWueU15F8Q", "url": "SHWueU15F8Q", "title": "Can Different Tennis Techniques Produce The Same Shot?", "description": "http://www.feeltennis.net/different-tennis-techniques/\n\nYou can hit the same shot with a different tennis technique, in this case a forehand. The popular belief is that you need to know how...", "duration": 136.0, "view_count": 19444, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "at_fguVKKJI", "url": "at_fguVKKJI", "title": "Best Tennis Smash Drill", "description": "This is my favourite tennis drill for smash / overhead. The rules are simple: one player has to alternate smashing left and right while the other can only lob. You can play to 7 or 11 and then...", "duration": 107.0, "view_count": 51356, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "JoR9scRdHzg", "url": "JoR9scRdHzg", "title": "Shoulder Over Shoulder Serve Move And Why You Need It", "description": "http://www.feeltennis.net/shoulder-over-shoulder-serve-technique-explained/\n\nIn order to generate the maximum speed of the racquet head in a tennis serve, we need to use the principle of \"transfer...", "duration": 430.0, "view_count": 179276, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "0_Ya3I5sn40", "url": "0_Ya3I5sn40", "title": "How to Hit A Topspin Forehand or Backhand in Tennis", "description": "http://www.feeltennis.net/how-to-hit-topspin-in-tennis/\n\nLearning to hit a topspin forehand or backhand in tennis can be quite a fast process if you apply \"rolling the ball\" drill above.\n\nThe...", "duration": 206.0, "view_count": 371139, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "srlGa9QyG7E", "url": "srlGa9QyG7E", "title": "How to Play Tennis With Feel", "description": "http://www.feeltennis.net/how-to-play-tennis/\n\nYou have probably seen a good tennis player warming up or just hitting for fun and wondered how it is possible for him to be so relaxed while...", "duration": 388.0, "view_count": 138556, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "t_WW6nLiLTE", "url": "t_WW6nLiLTE", "title": "How Develop Good Hands At The Net - 3 Volley Drills For Feel and Touch", "description": "http://www.feeltennis.net/develop-good-hands-volley/\n\nIf you want to become more skilled at the net in tennis, then you need a wider range of volleys besides the traditional punch volley.\n...", "duration": 471.0, "view_count": 184583, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "MO01CaN6lFc", "url": "MO01CaN6lFc", "title": "Tennis Forehand Contact Point And How To Find It", "description": "http://www.feeltennis.net/tennis-forehand-contact-point/\n\nThe following tennis drills help you find an optimal forehand contact point and can be applied to any type of grip or any type of footwork....", "duration": 638.0, "view_count": 640042, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "tEbGVa7mxqM", "url": "tEbGVa7mxqM", "title": "How to Handle High Balls in Tennis (Backhand and Forehand)", "description": "http://www.feeltennis.net/how-to-deal-with-high-balls/\n\nIn order to handle a high ball to your backhand or forehand in tennis, you need to adjust in two ways: prepare higher and hit more across...", "duration": 702.0, "view_count": 1949606, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "qRh_ArCv9OM", "url": "qRh_ArCv9OM", "title": "Advanced Tennis Volley Technique - The \"Flowing\" Volley", "description": "http://www.feeltennis.net/flowing-tennis-volley-technique/\n\nThe flowing volley in tennis is in my opinion the most common type of volley technique used by the pros and yet it is not really...", "duration": 558.0, "view_count": 265074, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "F_y52kmOyF4", "url": "F_y52kmOyF4", "title": "Tennis Serving Tip: The \"Drunken\" Serve", "description": "The \"drunken tennis serve\" tip is a very fun exercise that teaches the player to hit their serve more loose and relaxed and therefore increase the speed.\n\nIt's best used when warming up the...", "duration": 91.0, "view_count": 41858, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "DPuSndj-l9I", "url": "DPuSndj-l9I", "title": "A More Biting Backhand Slice - Quick Tip", "description": "http://www.feeltennis.net/backhand-slice-tip/\n\nIn most cases the backhand slice shots of recreational tennis players as well as juniors are floating too much and are too slow to cause any problems...", "duration": 379.0, "view_count": 184481, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "qGw48y3GEHU", "url": "qGw48y3GEHU", "title": "Adding Power To Tennis Serves With Proper Body Alignment", "description": "http://www.feeltennis.net/generate-power-tennis-serve/\n\nMost recreational tennis players and juniors are looking for power on a tennis serve in the wrong place. They tend to lean forward and...", "duration": 356.0, "view_count": 115135, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "re6rDiYr1PQ", "url": "re6rDiYr1PQ", "title": "3 Drills To Improve Timing in Tennis", "description": "http://www.feeltennis.net/improve-timing-tennis/\n\nTiming in tennis is often overlooked because there so much attention put into technique. As if correct technique would solve all your tennis...", "duration": 456.0, "view_count": 1011210, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "3cBxB-pr2Sw", "url": "3cBxB-pr2Sw", "title": "Tennis Serve Pronation Exercise For Top Spin Serves", "description": "If you're struggling with power on your second serves then try this tennis serve pronation drill. 🎾 Free Second Serve CONSISTENCY COURSE: https://www.feeltennis.net/second-serve-tips/\n\nThis...", "duration": 252.0, "view_count": 373040, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "6sSwBnGHmQM", "url": "6sSwBnGHmQM", "title": "Learn To Serve In Tennis With A Loose Wrist: The Bag Trick", "description": "http://www.serveunlocked.com\n\nOne of the main reasons why your serve in tennis lacks power is because you may grip the racquet too tight. It's hard to unlearn that only by hearing about a loose...", "duration": 261.0, "view_count": 108096, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "EgmNag6Ebyw", "url": "EgmNag6Ebyw", "title": "Tennis Serve Racquet Path - Linear vs Circular", "description": "http://www.serveunlocked.com\n\nThe key to developing really effective tennis serve technique is accelerating the racquet along the circular path. Most club and junior tennis players visualize...", "duration": 526.0, "view_count": 747721, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "jLcznUls5CI", "url": "jLcznUls5CI", "title": "How to Effortlessly Generate Powerful Tennis Serves", "description": "http://www.serveunlocked.com/\n\nThis is a sample video from the Serve Unlocked video course that teaches you how increase the speed of your tennis serve by using the laws of biomechanics. The...", "duration": 508.0, "view_count": 540171, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "WsJJ_BWBQcI", "url": "WsJJ_BWBQcI", "title": "How To Hit Fast Tennis Serves - Tips And Drills", "description": "http://www.feeltennis.net/tennis-serving-tips-how-to-serve-fast-and-yet-effortless/\n\nThe following series of tips and drills with help you feel the movement in a tennis serve that creates the...", "duration": 204.0, "view_count": 204312, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "c9bf9W0abhg", "url": "c9bf9W0abhg", "title": "Consistent Overheads When Moving Backwards", "description": "http://www.feeltennis.net/miss-overheads-backwards/\n\nThe most common mistake when hitting an overhead in tennis and moving backward is hitting into the net. But since you miss overheads just...", "duration": 150.0, "view_count": 19899, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "TAOgTbjF4FE", "url": "TAOgTbjF4FE", "title": "How To Self-Correct In Tennis", "description": "http://www.feeltennis.net/improve-the-accuracy-fast/\n\nYou will improve the accuracy of your shots much faster if you adjust your aim rather than trying to adjust your stroke. While it makes...", "duration": 209.0, "view_count": 24644, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "JTRPN_LyiXw", "url": "JTRPN_LyiXw", "title": "2 Drills For Developing Powerful Tennis Serves", "description": "http://www.feeltennis.net/tennis-serve-develop-power/\n\nThe main reason why your tennis serve lacks power is because you keep trying to hit the service box. Because the service box is rather...", "duration": 415.0, "view_count": 237467, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "NehyqjhDbsM", "url": "NehyqjhDbsM", "title": "The \"Minimum Effort\" Drill - And How To Play Effortless Tennis", "description": "http://www.feeltennis.net/effortless-tennis-strokes/\n\nLearn how to develop effortless tennis strokes with the \"minimum effort\" drill that helps you realize that you need much less effort to...", "duration": 627.0, "view_count": 193018, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "8LA-jBkFyAA", "url": "8LA-jBkFyAA", "title": "Tennis Technique Myth - What Is Correct Technique?", "description": "http://www.feeltennis.net/tennis-technique-myth/\n\nThe myth of correct tennis technique is the idea that you must move body parts (legs, hips, shoulders, hands, etc.) in a correct way in order...", "duration": 304.0, "view_count": 69798, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "mlwVVVVzXAI", "url": "mlwVVVVzXAI", "title": "Simple Tennis Forehand Tips For More Power And Topspin", "description": "http://www.feeltennis.net/tennis-forehand-tips/\n\nThese are simple tips to improve your forehand shot in tennis:\n- generate power with rotation and arm extension through the contact zone\n- generate...", "duration": 474.0, "view_count": 1126928, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "sFrg3zSfnec", "url": "sFrg3zSfnec", "title": "Three Tips For Improving A Lefty Tennis Forehand", "description": "http://www.feeltennis.net/3-tips-for-improving-a-lefty-forehand/\n\nIn this forehand comparison video you can find three tennis tips for Niko's forehand when compared to the big weapon of Rafael...", "duration": 153.0, "view_count": 90571, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "1EgVCzIrGUI", "url": "1EgVCzIrGUI", "title": "Feeling The Ball On Your Racquet And Hitting Effortlessly", "description": "http://www.feeltennis.net/feel-the-ball/\n\nYou might have heard the idea of feeling the ball - especially on the forehand and backhand groundstrokes - but what does that actually mean and how...", "duration": 139.0, "view_count": 33750, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "mxVP_KkdF-I", "url": "mxVP_KkdF-I", "title": "Improve Your Tennis Serve With 2 Simple Drills", "description": "http://www.feeltennis.net/improve-tennis-serve/\n\nWhat are some effective ways and drills to improve your tennis serve?\n\nBefore trying to change the technique of the serve, the player must change...", "duration": 353.0, "view_count": 193841, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "ixtikTVrpEY", "url": "ixtikTVrpEY", "title": "How To Hit A Tennis Volley - Tip For More Feel", "description": "http://www.feeltennis.net/how-to-hit-tennis-volley/\n\nIf you're learning to hit a volley in tennis, then the most common instruction is to punch it. But punching the volley causes you to become...", "duration": 447.0, "view_count": 259010, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "7zsWoOOWUbc", "url": "7zsWoOOWUbc", "title": "Tennis Volley Tip - How To Prepare In 2 Simple Steps", "description": "Here's quick tennis tip on how to prepare for the volley in 2 simple steps:\n\nhttp://www.feeltennis.net/volley-preparation/\n\nBegin by standing with a wide stance feeling the ground well and...", "duration": 251.0, "view_count": 106531, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "ZTg9gpMtAmw", "url": "ZTg9gpMtAmw", "title": "Tennis Serve Toss For Flat, Slice And Top Spin Serves", "description": "An optimal tennis serve toss is when you can serve flat, slice and topspin serves with comfort and power. 🎾 Free Topspin Serve CONSISTENCY COURSE: https://www.feeltennis.net/second-serve-tips/...", "duration": 399.0, "view_count": 972711, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "l0dqozevSEk", "url": "l0dqozevSEk", "title": "Improve Your Tennis Slice Serve With This Feel Drill", "description": "http://www.feeltennis.net/improve-the-feel-on-the-slice-serve/\n\nA simple tennis drill to work on your slice serve and refine the feel for hitting the ball with slice. Don't worry about the...", "duration": 230.0, "view_count": 189892, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "NQnQ60vFpdc", "url": "NQnQ60vFpdc", "title": "How To Improve A Top Spin Tennis Serve", "description": "http://www.feeltennis.net/improve-topspin-tennis-serve-technique/\n\nThe top spin serve in tennis can often cause you problems because you may rotate too much when hitting the ball. This habit...", "duration": 487.0, "view_count": 327220, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "S6KdH2ci4oA", "url": "S6KdH2ci4oA", "title": "How To Play Tennis The Natural Way", "description": "http://www.feeltennis.net\n\nPlaying tennis can be much simpler than going through mechanics in order to produce a shot. You simply play the ball.", "duration": 328.0, "view_count": 39901, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "B4ZByZjmSwc", "url": "B4ZByZjmSwc", "title": "Learning The Optimal Forehand And Backhand Racquet Path", "description": "http://www.feeltennis.net/feeling-the-correct-racquet-path-on-the-forehand-and-backhand-strokes/\n\nThis tennis drill helps you feel the correct racquet path on the forehand and backhand groundstroke...", "duration": 736.0, "view_count": 173816, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "bG4r6mCstSQ", "url": "bG4r6mCstSQ", "title": "Mistakes In Tennis And How To Accept Them", "description": "http://www.feeltennis.net/how-to-be-at-peace-with-mistakes-in-tennis/\n\nEverywhere I look on tennis courts I see people suffer because of errors they make.\n\nEvery mistake is followed by a negative...", "duration": 253.0, "view_count": 26381, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "9jYK1qKyOFI", "url": "9jYK1qKyOFI", "title": "How To Hit A Tennis Ball", "description": "http://www.feeltennis.net/how-to-hit-a-tennis-ball/\n\nLearning to hit a tennis ball correctly is in my opinion much more important than learning mechanics of the stroke. In fact, the mechanics...", "duration": 779.0, "view_count": 234763, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "jv6l8o5nehM", "url": "jv6l8o5nehM", "title": "Djokovic vs Isner and Federer vs Isner - Different Tactics", "description": "John Isner played his best tennis against Novak Djokovic in the semi-finals of the Indian Wells 2012 ATP Masters and managed to beat him. He then lost in the final against Roger Federer. Although...", "duration": 63.0, "view_count": 12511, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "aXtAqAdOLJo", "url": "aXtAqAdOLJo", "title": "Juan Carlos Ferrero At The US Open 2011 - 1st round", "description": "Juan Carlos Ferrero was battling it out on one of the side courts at the US Open 2011. He eventually won against Pablo Andujar in 5 sets. It's amazing to sit so close to the players and observe...", "duration": 32.0, "view_count": 6522, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "7xirLY_9ppg", "url": "7xirLY_9ppg", "title": "A Learned Tennis Serve And A Natural Throw Of The Racquet", "description": "http://www.tennismindgame.com/serve-natural.html\r\n\r\nThe following video shows the difference in a learned tennis serve which looks good but lacks power - and a natural way of throwing the racquet...", "duration": 58.0, "view_count": 15519, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "LpcJM2JrKu8", "url": "LpcJM2JrKu8", "title": "How To Warm Up For Tennis On Mini Court", "description": "Whether you're warming up for a simple hitting lesson on court or for a tennis match, you need to warm up properly so that you raise your state. And by state I mean your body temperature and...", "duration": 159.0, "view_count": 22289, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "GJ3NQkOSVA8", "url": "GJ3NQkOSVA8", "title": "One-Handed Backhand - Drill #9: Copy The Forehand", "description": "http://www.tennismindgame.com/one-handed-backhand.html This drill is not so much a technical one as it is a tactical one. Your goal is to copy the ball flight from the forehand side to your...", "duration": 153.0, "view_count": 48764, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "_gkBkSO0fA0", "url": "_gkBkSO0fA0", "title": "One-Handed Backhand - Drill #8: Using The Legs - Grounding", "description": "http://www.tennismindgame.com/one-handed-backhand.html The term grounding works much better than \"bend your knees\". The key is to feel the ground before the his and initiate your one-handed...", "duration": 132.0, "view_count": 55197, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "luJXnKy_5bs", "url": "luJXnKy_5bs", "title": "One-Handed Backhand - Drill #7: One And Two", "description": "http://www.tennismindgame.com/one-handed-backhand.html This another correction of your one-handed backhand if you happen to rotate too much. Make sure you combine the \"One and Two\" drill with...", "duration": 214.0, "view_count": 51526, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "NTQ9p5ZAKyU", "url": "NTQ9p5ZAKyU", "title": "One-Handed Backhand - Drill #6: Non-dominant Arm Back", "description": "http://www.tennismindgame.com/one-handed-backhand.html Keeping the non-dominant arm back can be a part of your normal one-handed backhand technique but it can also be an exercise that will...", "duration": 133.0, "view_count": 52479, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "OviyipaBok0", "url": "OviyipaBok0", "title": "One-Handed Backhand - Drill #5: Let Go And Control The Line", "description": "When you're developing your one-handed backhand technique, you may lose the fluidity of the movement because you're trying to control a new movement \"too much\". Use this drill to find effortless...", "duration": 232.0, "view_count": 92872, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "VDuQ07MeYxk", "url": "VDuQ07MeYxk", "title": "Advanced Tennis Backhand - Drill 4: Develop Spin - Under & Over", "description": "http://www.tennismindgame.com/advanced-tennis-backhand.html In order to generate good spin with your backhand, you need to keep good racquet head speed throughout the contact zone. Focus on...", "duration": 172.0, "view_count": 78408, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "JS_Yutt2jSA", "url": "JS_Yutt2jSA", "title": "Advanced Tennis Backhand - Drills 2 & 3: Lifting The Ball", "description": "http://www.tennismindgame.com/advanced-tennis-backhand.html If a player wants to feel confident about his backhand, he needs to be able to rally safely without many mistakes. Beginners and...", "duration": 231.0, "view_count": 129137, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "dlyc-hsG-BE", "url": "dlyc-hsG-BE", "title": "Advanced Tennis Backhand - Drill 1: Alley Rally", "description": "http://www.tennismindgame.com/advanced-tennis-backhand.html The basic foundation of an advanced tennis backhand is hitting the ball without much spin, driving through without much spin and...", "duration": 40.0, "view_count": 26027, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "ZtcLHqHV5Ys", "url": "ZtcLHqHV5Ys", "title": "Advanced Tennis Backhand - Mini Tennis: Short Backswing And Extend", "description": "http://www.tennismindgame.com/advanced-tennis-backhand.html The basic foundation of an advanced backhand is starting with a short backswing where the racquet is still parallel to the ground...", "duration": 73.0, "view_count": 23132, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "7taVCn_dgTQ", "url": "7taVCn_dgTQ", "title": "Advanced Tennis Backhand Technique - Step 1: Assessment", "description": "http://www.tennismindgame.com/advanced-tennis-backhand.html Developing an advanced backhand in tennis is about getting the fundamentals right - from which you can build more advanced strokes....", "duration": 185.0, "view_count": 89863, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "_BhmPWEwBxw", "url": "_BhmPWEwBxw", "title": "Teniska taktika DVD - od zacetnika do mojstra", "description": "Posebnost DVD-ja Teniška taktika je prikaz napačnih taktik oz. možnosti, ko določene taktike niso uspešne. Video primer prikazuje napačen prihod na mrežo s prepočasno žogo in dva pravilna...", "duration": 77.0, "view_count": 6944, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "8t_Y6w2vfxY", "url": "8t_Y6w2vfxY", "title": "Teniska taktika DVD - Takticne kombinacije", "description": "Na DVD-ju \"Teniska taktika - od zacetnika do mojstra\" boste nasli tudi 15 najbolj pogostih takticnih kombinacij. Vec o DVD-ju lahko izveste na http://www.tennismindgame.com/teniska-taktika.html .", "duration": 46.0, "view_count": 5082, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "NtUMKJadfXg", "url": "NtUMKJadfXg", "title": "Nicolas Massu playing tennis at Umag 2009 ATP", "description": "I watched Nicolas Massu from Chile playing live for the first time and was amazed at his incredible forehand. This is in my opinion top 5 forehand on ATP at the moment. \n\nHe can take the ball...", "duration": 57.0, "view_count": 5245, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "2MswyYpO_qc", "url": "2MswyYpO_qc", "title": "Basic Tactical Tennis Drill - Only Cross Court For One Player", "description": "http://www.tennismindgame.com/basic-tactics-drills.html In order to help players focus on their tactical options (where to play the ball), you can practice in semi-open tennis drills. The white...", "duration": 24.0, "view_count": 44996, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "JXS-0I8FsF0", "url": "JXS-0I8FsF0", "title": "Tennis Tactics Mistakes - Attacking Behind the baseline", "description": "The orange player attempted a short cross court shot while being behind the baseline and in the middle. That's a typical tactical mistake in tennis.", "duration": 8.0, "view_count": 21912, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "vEaTahsXnRI", "url": "vEaTahsXnRI", "title": "Tennis Tactics - Missing an Easy Sitter", "description": "The player has missed an easy sitter because he may have been aiming to close to the sidelines and because he hasn't practiced enough hitting accurate shots while on the run.", "duration": 14.0, "view_count": 17363, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "aISAW8vCeoQ", "url": "aISAW8vCeoQ", "title": "Tennis Tactics Mistake - Don't Defend Down-the-line", "description": "http://www.tennismindgame.com/analyze-mistakes.html\r\n\r\nThe white player was slightly in defensive position (caught on the wrong foot) and played the ball down the line. He was then unable to...", "duration": 13.0, "view_count": 11121, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "GG3xHFJoCnE", "url": "GG3xHFJoCnE", "title": "Tennis Miss - B Slice Cross court", "description": "The orange player defended with a correct tennis tactic - playing a cross court backhand slice, but missed the shot because of the lack of practice or skill.", "duration": 13.0, "view_count": 11488, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "yJPZF0BVTkY", "url": "yJPZF0BVTkY", "title": "Tennis Tactics Mistakes - Defending to the middle and short", "description": "The white player plays an incorrect tennis tactic by defending to the middle and short. Eventually he loses the point. While defending to the middle may work if the ball is really deep, it's...", "duration": 8.0, "view_count": 11596, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "BLXPyy5etu8", "url": "BLXPyy5etu8", "title": "Playing a Set With Modified Rules", "description": "The rules are explained in more detail at http://www.tennismindgame.com/poonky3.html", "duration": 88.0, "view_count": 10950, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "icn3X_Tc5qM", "url": "icn3X_Tc5qM", "title": "Developing A Tennis Slice Serve", "description": "A tennis serve is basically a throwing motion so there needs to be a lot of throwing drills especially with kids.", "duration": 294.0, "view_count": 73659, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "T7WuPnJtczY", "url": "T7WuPnJtczY", "title": "Ball Control and Footwork Tennis Drill", "description": "This tennis drill combines forward - backward footwork, ball control and reading a short ball. It can be played down the line or cross-court.", "duration": 52.0, "view_count": 35162, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "ifF_SX1rx9k", "url": "ifF_SX1rx9k", "title": "Tennis Drill - Using The Body Rotation", "description": "The main power in tennis comes from body rotation. Especially on the forehand and backhand groundstrokes. Here's a tennis drill to learn that...", "duration": 142.0, "view_count": 151224, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "bgFBKFNSv8g", "url": "bgFBKFNSv8g", "title": "Training Quick Preparation In Tennis", "description": "Instead of taking the racquet back, the player needs to rotate the body in tennis. This is often called the \"unit turn\". Here's a fun drill to practice that...", "duration": 90.0, "view_count": 26049, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "6qwVWIYRW3c", "url": "6qwVWIYRW3c", "title": "Improving Reactions And Fun Tennis Volley Drill", "description": "It's very useful to do some reaction drills before training a tennis volley. Kids love these kinds of drills and they are extremely useful for developing reactions and hand-eye coordination.", "duration": 74.0, "view_count": 59401, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "Dn6kpiGKxys", "url": "Dn6kpiGKxys", "title": "Tennis Footwoork Drill - Short and Long", "description": "This tennis footwork drill is quite simple - short ball and then a long ball. But the key is that the player learn to run forward and backward instead of shuffling as most players try to move.", "duration": 183.0, "view_count": 34802, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "13v8QCAnJ3c", "url": "13v8QCAnJ3c", "title": "Tennis Warm Up - Two Lines Drill", "description": "This tennis warm up drill includes typical coordination exercises for warm up and makes it a little more interesting by doing all that on the doubles and singles sidelines.", "duration": 250.0, "view_count": 43200, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "rpE-4vAE9Yw", "url": "rpE-4vAE9Yw", "title": "Perfectly Disguised Tennis Drop Shot", "description": "With this perfect disguise your opponent will never even start running towards the drop shot.\r\n\r\nI warn you though: this takes time to master. ;)", "duration": 23.0, "view_count": 104469, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "ns_Ac-wtTic", "url": "ns_Ac-wtTic", "title": "How To Pick Up A Tennis Ball - From Hopeless To Jedi Master", "description": "During your tennis journey towards better tennis strokes you'll also want to become a jedi master in picking up a tennis ball.", "duration": 133.0, "view_count": 110142, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "O9yWA9Ho73M", "url": "O9yWA9Ho73M", "title": "Topspin Tennis Serve Part IV - Drills For The Next Level", "description": "Use these drills to refine the feel of your topspin tennis serve. Learn to Agassi kicker for surprise serves when you need them.", "duration": 102.0, "view_count": 328322, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "YZxK8YBJqNQ", "url": "YZxK8YBJqNQ", "title": "Topspin Tennis Serve Part III - Adding Power", "description": "Add power to your serve by using more leg drive and tossing more inside the court. A fast tennis serve is also a result of having a loose arm.", "duration": 55.0, "view_count": 350264, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "nNvD7-KbcEA", "url": "nNvD7-KbcEA", "title": "Topspin Tennis Serve Part II - Develop Correct Technique", "description": "Follow the progression in this video to develop correct tennis topspin serve technique.", "duration": 50.0, "view_count": 378499, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "iRaONZgUg-k", "url": "iRaONZgUg-k", "title": "Topspin Tennis Serve Part I - Develop Feel", "description": "Use these two tennis serve drills to develop better feel for topspin.", "duration": 66.0, "view_count": 423764, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "H8creLxMNWQ", "url": "H8creLxMNWQ", "title": "The Differences Between Topspin And Flat Tennis Serve", "description": "A top spin serve has a more sideways stance, contact point is more above the head and the sound of hitting the ball with spin is different.", "duration": 58.0, "view_count": 140121, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "c5VxqZMSHWA", "url": "c5VxqZMSHWA", "title": "Origin of Tennis Serve Part VI - The Swing", "description": "You already know how to hit the ball, now you just need to add more power. Just hit more.", "duration": 35.0, "view_count": 36490, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "dSob6koudZY", "url": "dSob6koudZY", "title": "Origin of Tennis Serve Part III - Sideways and Grip", "description": "In order to serve fast and with good consistency, you need to spin the ball slightly. It's much easier to do that if you position yourself sideways and adjust the grip.", "duration": 41.0, "view_count": 35879, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "QJRXL9K8I94", "url": "QJRXL9K8I94", "title": "Origin of Tennis Serve Part II - Pronation", "description": "It's not easy to find pronation in the serve on your own. You either need to see it in action or a tennis coach shows you how to do it. There is a lot of power hidden in it.", "duration": 34.0, "view_count": 41579, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "s693uqS0QS4", "url": "s693uqS0QS4", "title": "Origin of Tennis Serve Part I - Simple Serve", "description": "The most obvious way to serve in tennis is like this. But you know that none of the pros serves like this, right? So how did a tennis serve evolve?", "duration": 30.0, "view_count": 26935, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "gNI5zF0iOj4", "url": "gNI5zF0iOj4", "title": "Developing Tennis Groundstroke Technique", "description": "This last video in the Origin of tennis technique video shows how you need to combine the two main keys to hitting a good forehand or backhand - hitting forward through the ball and spin.\n...", "duration": 48.0, "view_count": 56542, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "BHSUak5EE_U", "url": "BHSUak5EE_U", "title": "Tennis Footwork - Forehand And Backhand", "description": "The best way to develop good tennis footwork is by experimenting and feeling which footwork feels best, gives you the best balance and best way to transfer weight into the ball. This video...", "duration": 69.0, "view_count": 94655, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "AwV9Qrnu0o8", "url": "AwV9Qrnu0o8", "title": "How To Find The Correct Tennis Backhand Grip", "description": "Similar to the forehand video, this one shows a simple way of experimenting with backhand grips in order to find the most comfortable one. This is the 6th video in the Origin of tennis technique...", "duration": 84.0, "view_count": 144338, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "-jydJSzdEtg", "url": "-jydJSzdEtg", "title": "How To Find Your Tennis Forehand Grip", "description": "This video shows you how you can find a forehand grip by experimenting and feeling which grip is the most comfortable. No need to read tennis instruction manuals, just play and try.", "duration": 91.0, "view_count": 96086, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "Zqd4iHTfa_0", "url": "Zqd4iHTfa_0", "title": "Adding Top Spin To Forehand And Backhand", "description": "The next step after hitting the ball forward is to add top spin. That's the only way to hit a forehand or a backhand fast and keep it in the court. This is the second key to developing tennis...", "duration": 41.0, "view_count": 217714, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "QtOsr29lvp8", "url": "QtOsr29lvp8", "title": "Tennis Technique - Drive The Racquet Forward Through The Bal", "description": "The is the first key to tennis technique - forehand and backhand. Drive the racquet forward towards the target without changing the angle of the racquet face.", "duration": 106.0, "view_count": 138562, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "9Da41sCg8Hw", "url": "9Da41sCg8Hw", "title": "Tennis Forehand And Backhand Full Swing", "description": "This video shows what happens if you just swing at the ball with forehand or backhand without hitting straight for a while. This is the second part of Tennis tehnique series.", "duration": 47.0, "view_count": 46405, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "1iuh2rseP7w", "url": "1iuh2rseP7w", "title": "Understanding The Angles - Tennis Racquet And Ball", "description": "This is the first video of the Tennis Technique series. See how the direction of the outgoing ball is determined by the racquet head angle.", "duration": 22.0, "view_count": 18979, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "woH8uZlDjUg", "url": "woH8uZlDjUg", "title": "Tennis Serve Acceleration Tip", "description": "The key to developing a powerful tennis serve is the acceleration or the racquet drop. There are 5 more videos in the full serve instruction guide for tennis beginners.", "duration": 93.0, "view_count": 417409, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "Nw8WE42LmLw", "url": "Nw8WE42LmLw", "title": "Tennis Backhand Follow-Through", "description": "Tennis beginners need to learn backhand groundstroke in a step-by-step progression to improve in the fastest way. This is only 1 of the 49 video clips in the full version of the How To Play...", "duration": 98.0, "view_count": 82459, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "bEKbbxkCmRA", "url": "bEKbbxkCmRA", "title": "Two-handed backhand drill - Left arm works more...", "description": "This simple mini tennis drill will \"teach\" your left arm, that it needs to work more when playing a two-handed backhand. Play 2-3 minutes when warming up.", "duration": 24.0, "view_count": 53970, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "r12VBPj8WLI", "url": "r12VBPj8WLI", "title": "Mini Tennis Drills - Forehand Only", "description": "Two players play crosscourt and can use only forehand. (on the deuce side for righthanders)\r\n\r\nYou also cannot come to the net, the ball must bounce once.\r\n\r\nThis tennis drill is very good...", "duration": 29.0, "view_count": 103607, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "5vXI8H3n0xE", "url": "5vXI8H3n0xE", "title": "Mini Tennis Drills - Catch & Throw", "description": "One player plays with a racquet and the other has to catch the ball and throw it over. Two rules: ball MUST bounce once and wherever you catch the ball, from there you must throw. That means...", "duration": 27.0, "view_count": 57038, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "8NE87T38Iv4", "url": "8NE87T38Iv4", "title": "Tennis Warm Up Drill - Volley at Your Court", "description": "This tennis drill is excellent for improving your anticipation, reaction and touch when you have to play close to the net. It teaches you to quickly react to the ball and not let it fall down....", "duration": 42.0, "view_count": 29846, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "K3pN2jx0JHg", "url": "K3pN2jx0JHg", "title": "Tennis Warm Up Drill -- Cross and Alternate", "description": "Play in the diagonal (opposite) service boxes. You always have to alternate your strokes -- one forehand and one backhand. If you play two forehands (or backhands) in a row you lose the point....", "duration": 45.0, "view_count": 40295, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "V866F0KIHis", "url": "V866F0KIHis", "title": "Tennis Warm Up Drill - \"Two Bounces\"", "description": "Play in both service boxes. You always have to hit the ball down into your court first. No volleys! Excellent drill for practicing coordination, top spin and footwork.", "duration": 31.0, "view_count": 30596, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "FUnzYc80rU0", "url": "FUnzYc80rU0", "title": "Warm up drill - \"No volleys\"", "description": "Serve begins with a drop from the net. Players are not allowed to play volleys (so back up quickly!) but you can hit hard if you are skilled enough to do that on short court. It's a great drill...", "duration": 31.0, "view_count": 42020, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "9CWHKDz8hqo", "url": "9CWHKDz8hqo", "title": "Tennis Warm Up Drill - Serve & Volley on mini court", "description": "My friend Dia and me warming up. Serve under hand and approach the net. Only one rule: no hard hitting. Use finesse and touch. Play up to 7 or 11.", "duration": 41.0, "view_count": 51028, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "T-_DplFuAAU", "url": "T-_DplFuAAU", "title": "DVD Intro - Slovenian version", "description": "This is the intro to the DVD Basic Tennis Tactics that my friend Borut Urh and me produced for Slovenia. We are preparing an English version too. Stay tuned...", "duration": 50.0, "view_count": 6178, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "5YxD3xyfuEQ", "url": "5YxD3xyfuEQ", "title": "The Masterful Pusher", "description": "A friend of mine who is a master of tennis strategy although his strokes don't look spectatular.\r\n\r\nMy new ebook on tennis strategy will show you many ways how to beat the \"dreaded\" pusher...", "duration": 24.0, "view_count": 70854, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "K73sc8YdQYk", "url": "K73sc8YdQYk", "title": "Me playing in the winter", "description": "Hey, that's me again - playing in the winter under the \"baloon\" as we call them in Slovenia.", "duration": 81.0, "view_count": 31319, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "7IRNpfR4p4Y", "url": "7IRNpfR4p4Y", "title": "Me playing ;)", "description": "Hey, that's me playing! Just free hitting with my friend and enjoying the summer!", "duration": 33.0, "view_count": 19091, "uploader": null}, {"_type": "url", "ie_key": "Youtube", "id": "xNPaZj4yn00", "url": "xNPaZj4yn00", "title": "Roger Federer slow motion video", "description": "http://www.tennismindgame.com/roger-federer.html\r\n\r\nSuper slow motion videos of Roger Federer - hitting mostly forehands and a couple of backhands. Incredible detail of racquet vibrations,...", "duration": 235.0, "view_count": 2373826, "uploader": null}], "id": "UCTK9oKMGU0XIQpLJYDs45fw", "title": "Feel Tennis Instruction - Videos", "description": "Tennis instruction videos helping you develop basic and more advanced tennis technique through feel based drills and exercises.", "extractor": "youtube:tab", "webpage_url": "https://www.youtube.com/@feeltennis/videos", "webpage_url_basename": "videos", "extractor_key": "YoutubeTab"}
